/* automatically generated by rust-bindgen 0.71.1 */

pub const ADLX_VER_MAJOR: u32 = 1;
pub const ADLX_VER_MINOR: u32 = 4;
pub const ADLX_VER_RELEASE: u32 = 0;
pub const ADLX_VER_BUILD_NUM: u32 = 110;
pub const ADLX_DLL_NAMEW: &[u8; 14] = b"amdadlx64.dll\0";
pub const ADLX_DLL_NAMEA: &[u8; 14] = b"amdadlx64.dll\0";
pub const ADLX_DLL_NAME: &[u8; 14] = b"amdadlx64.dll\0";
pub const ADLX_QUERY_FULL_VERSION_FUNCTION_NAME: &[u8; 21] = b"ADLXQueryFullVersion\0";
pub const ADLX_QUERY_VERSION_FUNCTION_NAME: &[u8; 17] = b"ADLXQueryVersion\0";
pub const ADLX_INIT_FUNCTION_NAME: &[u8; 15] = b"ADLXInitialize\0";
pub const ADLX_INIT_WITH_INCOMPATIBLE_DRIVER_FUNCTION_NAME: &[u8; 37] =
    b"ADLXInitializeWithIncompatibleDriver\0";
pub const ADLX_INIT_WITH_CALLER_ADL_FUNCTION_NAME: &[u8; 28] = b"ADLXInitializeWithCallerAdl\0";
pub const ADLX_TERMINATE_FUNCTION_NAME: &[u8; 14] = b"ADLXTerminate\0";
pub type wchar_t = ::std::os::raw::c_ushort;
pub type adlx_int64 = i64;
pub type adlx_int32 = i32;
pub type adlx_uint64 = u64;
pub type adlx_uint32 = u32;
pub type adlx_uint16 = u16;
pub type adlx_uint8 = u8;
pub type adlx_size = usize;
pub type adlx_handle = *mut ::std::os::raw::c_void;
pub type adlx_double = f64;
pub type adlx_long = ::std::os::raw::c_long;
pub type adlx_int = adlx_int32;
pub type adlx_ulong = ::std::os::raw::c_ulong;
pub type adlx_uint = adlx_uint32;
pub type adlx_bool = adlx_uint8;
#[doc = "< @ENG_START_DOX This result indicates success. @ENG_END_DOX"]

pub const ADLX_ANTILAG_STATE_ANTILAGNEXT: ADLX_ANTILAG_STATE = 1;
#[doc = " @enum ADLX_ANTILAG_STATE\n @ingroup enumerations\n @ENG_START_DOX\n @brief Indicates the state of Anti Lag.\n @ENG_END_DOX"]
pub type ADLX_ANTILAG_STATE = ::std::os::raw::c_int;
#[doc = "< @ENG_START_DOX The GPU is not part of an AMD MGPU configuration. @ENG_END_DOX"]
pub const ADLX_MGPU_MODE_MGPU_NONE: ADLX_MGPU_MODE = 0;
#[doc = "< @ENG_START_DOX The GPU is the primary GPU in an AMD MGPU configuration. @ENG_END_DOX"]
pub const ADLX_MGPU_MODE_MGPU_PRIMARY: ADLX_MGPU_MODE = 1;
#[doc = "< @ENG_START_DOX The GPU is the secondary GPU in an AMD MGPU configuration. @ENG_END_DOX"]
pub const ADLX_MGPU_MODE_MGPU_SECONDARY: ADLX_MGPU_MODE = 2;
#[doc = " @enum ADLX_MGPU_MODE\n @ingroup enumerations\n @ENG_START_DOX\n @brief Indicates the AMD MGPU mode.\n @ENG_END_DOX"]
pub type ADLX_MGPU_MODE = ::std::os::raw::c_int;
#[doc = "< @ENG_START_DOX It is unknown if the application is bound to the GPU on which it runs. The application might behave unexpectedly if the GPU is powered off or disabled. @ENG_END_DOX"]
pub const ADLX_APP_GPU_DEPENDENCY_APP_GPU_UNKNOWN: ADLX_APP_GPU_DEPENDENCY = 0;
#[doc = "< @ENG_START_DOX The application is bound to the GPU on which it runs and will behave unexpectedly if the GPU is powered off or disabled. @ENG_END_DOX"]
pub const ADLX_APP_GPU_DEPENDENCY_APP_GPU_BOUND: ADLX_APP_GPU_DEPENDENCY = 1;
#[doc = "< @ENG_START_DOX The application is not bound to this GPU on which it runs and will continue to run properly if the GPU is powered off or disabled. @ENG_END_DOX"]
pub const ADLX_APP_GPU_DEPENDENCY_APP_GPU_NOT_BOUND: ADLX_APP_GPU_DEPENDENCY = 2;
#[doc = " @enum ADLX_APP_GPU_DEPENDENCY\n @ingroup enumerations\n @ENG_START_DOX\n @brief Indicates the type of dependence of an application on the GPU on which it runs.\n @ENG_END_DOX"]
pub type ADLX_APP_GPU_DEPENDENCY = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXInterfaceVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXInterface) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXInterface) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXInterface,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXInterfaceVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXInterfaceVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXInterfaceVtbl>(),
        24usize,
        "Size of IADLXInterfaceVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXInterfaceVtbl>(),
        8usize,
        "Alignment of IADLXInterfaceVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXInterfaceVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXInterfaceVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXInterfaceVtbl::QueryInterface"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXInterface {
    pub pVtbl: *const IADLXInterfaceVtbl,
}
#[test]
fn bindgen_test_layout_IADLXInterface() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXInterface> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXInterface>(),
        8usize,
        "Size of IADLXInterface"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXInterface>(),
        8usize,
        "Alignment of IADLXInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXInterface::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXListVtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXList) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXList) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXList,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub Size: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXList) -> adlx_uint>,
    pub Empty: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXList) -> adlx_bool>,
    pub Begin: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXList) -> adlx_uint>,
    pub End: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXList) -> adlx_uint>,
    pub At: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub Clear: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXList) -> ADLX_RESULT>,
    pub Remove_Back:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXList) -> ADLX_RESULT>,
    pub Add_Back: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXList, pItem: *mut IADLXInterface) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXListVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXListVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXListVtbl>(),
        88usize,
        "Size of IADLXListVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXListVtbl>(),
        8usize,
        "Alignment of IADLXListVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXListVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXListVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXListVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXListVtbl::Size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Empty) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXListVtbl::Empty"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Begin) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXListVtbl::Begin"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).End) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXListVtbl::End"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXListVtbl::At"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Clear) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXListVtbl::Clear"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Remove_Back) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXListVtbl::Remove_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXListVtbl::Add_Back"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXList {
    pub pVtbl: *const IADLXListVtbl,
}
#[test]
fn bindgen_test_layout_IADLXList() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXList>(),
        8usize,
        "Size of IADLXList"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXList>(),
        8usize,
        "Alignment of IADLXList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXList::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUVtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPU) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPU) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub VendorId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            vendorId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub ASICFamilyType: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            asicFamilyType: *mut ADLX_ASIC_FAMILY_TYPE,
        ) -> ADLX_RESULT,
    >,
    pub Type: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU, gpuType: *mut ADLX_GPU_TYPE) -> ADLX_RESULT,
    >,
    pub IsExternal: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU, isExternal: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub Name: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            gpuName: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub DriverPath: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            driverPath: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub PNPString: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            pnpString: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub HasDesktops: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU, hasDesktops: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub TotalVRAM: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU, vramMB: *mut adlx_uint) -> ADLX_RESULT,
    >,
    pub VRAMType: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            type_: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub BIOSInfo: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            partNumber: *mut *const ::std::os::raw::c_char,
            version: *mut *const ::std::os::raw::c_char,
            date: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub DeviceId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            deviceId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub RevisionId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            revisionId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub SubSystemId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            subSystemId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub SubSystemVendorId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU,
            subSystemVendorId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub UniqueId: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU, uniqueId: *mut adlx_int) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPUVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUVtbl>(),
        152usize,
        "Size of IADLXGPUVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUVtbl>(),
        8usize,
        "Alignment of IADLXGPUVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXGPUVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXGPUVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VendorId) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXGPUVtbl::VendorId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ASICFamilyType) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXGPUVtbl::ASICFamilyType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXGPUVtbl::Type"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsExternal) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXGPUVtbl::IsExternal"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXGPUVtbl::Name"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DriverPath) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXGPUVtbl::DriverPath"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PNPString) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXGPUVtbl::PNPString"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HasDesktops) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXGPUVtbl::HasDesktops"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TotalVRAM) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXGPUVtbl::TotalVRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VRAMType) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXGPUVtbl::VRAMType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BIOSInfo) as usize - ptr as usize },
        104usize,
        "Offset of field: IADLXGPUVtbl::BIOSInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeviceId) as usize - ptr as usize },
        112usize,
        "Offset of field: IADLXGPUVtbl::DeviceId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RevisionId) as usize - ptr as usize },
        120usize,
        "Offset of field: IADLXGPUVtbl::RevisionId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SubSystemId) as usize - ptr as usize },
        128usize,
        "Offset of field: IADLXGPUVtbl::SubSystemId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SubSystemVendorId) as usize - ptr as usize },
        136usize,
        "Offset of field: IADLXGPUVtbl::SubSystemVendorId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UniqueId) as usize - ptr as usize },
        144usize,
        "Offset of field: IADLXGPUVtbl::UniqueId"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPU {
    pub pVtbl: *const IADLXGPUVtbl,
}
#[test]
fn bindgen_test_layout_IADLXGPU() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPU> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPU>(),
        8usize,
        "Size of IADLXGPU"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPU>(),
        8usize,
        "Alignment of IADLXGPU"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPU::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUListVtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUList) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUList) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUList,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub Size: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUList) -> adlx_uint>,
    pub Empty: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUList) -> adlx_uint8>,
    pub Begin: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUList) -> adlx_uint>,
    pub End: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUList) -> adlx_uint>,
    pub At: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub Clear: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUList) -> ADLX_RESULT>,
    pub Remove_Back:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUList) -> ADLX_RESULT>,
    pub Add_Back: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUList, pItem: *mut IADLXInterface) -> ADLX_RESULT,
    >,
    pub At_GPUList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXGPU,
        ) -> ADLX_RESULT,
    >,
    pub Add_Back_GPUList: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUList, pItem: *mut IADLXGPU) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPUListVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUListVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUListVtbl>(),
        104usize,
        "Size of IADLXGPUListVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUListVtbl>(),
        8usize,
        "Alignment of IADLXGPUListVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUListVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXGPUListVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXGPUListVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXGPUListVtbl::Size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Empty) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXGPUListVtbl::Empty"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Begin) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXGPUListVtbl::Begin"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).End) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXGPUListVtbl::End"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXGPUListVtbl::At"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Clear) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXGPUListVtbl::Clear"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Remove_Back) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXGPUListVtbl::Remove_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXGPUListVtbl::Add_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At_GPUList) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXGPUListVtbl::At_GPUList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back_GPUList) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXGPUListVtbl::Add_Back_GPUList"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUList {
    pub pVtbl: *const IADLXGPUListVtbl,
}
#[test]
fn bindgen_test_layout_IADLXGPUList() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUList>(),
        8usize,
        "Size of IADLXGPUList"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUList>(),
        8usize,
        "Alignment of IADLXGPUList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUList::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUsEventListenerVtbl {
    pub OnGPUListChanged: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUsEventListener,
            pNewGPUs: *mut IADLXGPUList,
        ) -> adlx_bool,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPUsEventListenerVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUsEventListenerVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUsEventListenerVtbl>(),
        8usize,
        "Size of IADLXGPUsEventListenerVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUsEventListenerVtbl>(),
        8usize,
        "Alignment of IADLXGPUsEventListenerVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).OnGPUListChanged) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUsEventListenerVtbl::OnGPUListChanged"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUsEventListener {
    pub pVtbl: *const IADLXGPUsEventListenerVtbl,
}
#[test]
fn bindgen_test_layout_IADLXGPUsEventListener() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUsEventListener> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUsEventListener>(),
        8usize,
        "Size of IADLXGPUsEventListener"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUsEventListener>(),
        8usize,
        "Alignment of IADLXGPUsEventListener"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUsEventListener::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUsChangedHandlingVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUsChangedHandling) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUsChangedHandling) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUsChangedHandling,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub AddGPUsListEventListener: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUsChangedHandling,
            pListener: *mut IADLXGPUsEventListener,
        ) -> ADLX_RESULT,
    >,
    pub RemoveGPUsListEventListener: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUsChangedHandling,
            pListener: *mut IADLXGPUsEventListener,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPUsChangedHandlingVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUsChangedHandlingVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUsChangedHandlingVtbl>(),
        40usize,
        "Size of IADLXGPUsChangedHandlingVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUsChangedHandlingVtbl>(),
        8usize,
        "Alignment of IADLXGPUsChangedHandlingVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUsChangedHandlingVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXGPUsChangedHandlingVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXGPUsChangedHandlingVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AddGPUsListEventListener) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXGPUsChangedHandlingVtbl::AddGPUsListEventListener"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RemoveGPUsListEventListener) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXGPUsChangedHandlingVtbl::RemoveGPUsListEventListener"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUsChangedHandling {
    pub pVtbl: *const IADLXGPUsChangedHandlingVtbl,
}
#[test]
fn bindgen_test_layout_IADLXGPUsChangedHandling() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUsChangedHandling> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUsChangedHandling>(),
        8usize,
        "Size of IADLXGPUsChangedHandling"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUsChangedHandling>(),
        8usize,
        "Alignment of IADLXGPUsChangedHandling"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUsChangedHandling::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDesktopServices {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXLog {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUTuningServices {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXI2C {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemVtbl {
    pub GetHybridGraphicsType: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystem, hgType: *mut ADLX_HG_TYPE) -> ADLX_RESULT,
    >,
    pub GetGPUs: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            ppGPUs: *mut *mut IADLXGPUList,
        ) -> ADLX_RESULT,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub GetDisplaysServices: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            ppDispServices: *mut *mut IADLXDisplayServices,
        ) -> ADLX_RESULT,
    >,
    pub GetDesktopsServices: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            ppDeskServices: *mut *mut IADLXDesktopServices,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUsChangedHandling: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            ppGPUsChangedHandling: *mut *mut IADLXGPUsChangedHandling,
        ) -> ADLX_RESULT,
    >,
    pub EnableLog: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            mode: ADLX_LOG_DESTINATION,
            severity: ADLX_LOG_SEVERITY,
            pLogger: *mut IADLXLog,
            fileName: *const wchar_t,
        ) -> ADLX_RESULT,
    >,
    pub Get3DSettingsServices: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            pp3DSettingsServices: *mut *mut IADLX3DSettingsServices,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUTuningServices: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            ppGPUTuningServices: *mut *mut IADLXGPUTuningServices,
        ) -> ADLX_RESULT,
    >,
    pub GetPerformanceMonitoringServices: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            ppPerformanceMonitoringServices: *mut *mut IADLXPerformanceMonitoringServices,
        ) -> ADLX_RESULT,
    >,
    pub TotalSystemRAM: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystem, ramMB: *mut adlx_uint) -> ADLX_RESULT,
    >,
    pub GetI2C: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem,
            pGPU: *mut IADLXGPU,
            ppI2C: *mut *mut IADLXI2C,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXSystemVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemVtbl>(),
        96usize,
        "Size of IADLXSystemVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemVtbl>(),
        8usize,
        "Alignment of IADLXSystemVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetHybridGraphicsType) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemVtbl::GetHybridGraphicsType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUs) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXSystemVtbl::GetGPUs"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXSystemVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetDisplaysServices) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXSystemVtbl::GetDisplaysServices"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetDesktopsServices) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXSystemVtbl::GetDesktopsServices"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUsChangedHandling) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXSystemVtbl::GetGPUsChangedHandling"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EnableLog) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXSystemVtbl::EnableLog"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Get3DSettingsServices) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXSystemVtbl::Get3DSettingsServices"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUTuningServices) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXSystemVtbl::GetGPUTuningServices"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).GetPerformanceMonitoringServices) as usize - ptr as usize
        },
        72usize,
        "Offset of field: IADLXSystemVtbl::GetPerformanceMonitoringServices"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TotalSystemRAM) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXSystemVtbl::TotalSystemRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetI2C) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXSystemVtbl::GetI2C"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystem {
    pub pVtbl: *const IADLXSystemVtbl,
}
#[test]
fn bindgen_test_layout_IADLXSystem() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystem> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystem>(),
        8usize,
        "Size of IADLXSystem"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystem>(),
        8usize,
        "Alignment of IADLXSystem"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystem::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDesktop {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLMappingVtbl {
    pub GetADLXGPUFromBdf: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLMapping,
            bus: adlx_int,
            device: adlx_int,
            function: adlx_int,
            ppGPU: *mut *mut IADLXGPU,
        ) -> ADLX_RESULT,
    >,
    pub GetADLXGPUFromAdlAdapterIndex: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLMapping,
            adlAdapterIndex: adlx_int,
            ppGPU: *mut *mut IADLXGPU,
        ) -> ADLX_RESULT,
    >,
    pub BdfFromADLXGPU: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLMapping,
            pGPU: *mut IADLXGPU,
            bus: *mut adlx_int,
            device: *mut adlx_int,
            function: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub AdlAdapterIndexFromADLXGPU: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLMapping,
            pGPU: *mut IADLXGPU,
            adlAdapterIndex: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetADLXDisplayFromADLIds: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLMapping,
            adapterIndex: adlx_int,
            displayIndex: adlx_int,
            bus: adlx_int,
            device: adlx_int,
            function: adlx_int,
            ppDisplay: *mut *mut IADLXDisplay,
        ) -> ADLX_RESULT,
    >,
    pub ADLIdsFromADLXDisplay: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLMapping,
            pDisplay: *mut IADLXDisplay,
            adapterIndex: *mut adlx_int,
            displayIndex: *mut adlx_int,
            bus: *mut adlx_int,
            device: *mut adlx_int,
            function: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetADLXDesktopFromADLIds: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLMapping,
            adapterIndex: adlx_int,
            VidPnSourceId: adlx_int,
            bus: adlx_int,
            device: adlx_int,
            function: adlx_int,
            ppDesktop: *mut *mut IADLXDesktop,
        ) -> ADLX_RESULT,
    >,
    pub ADLIdsFromADLXDesktop: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLMapping,
            pDesktop: *mut IADLXDesktop,
            adapterIndex: *mut adlx_int,
            VidPnSourceId: *mut adlx_int,
            bus: *mut adlx_int,
            device: *mut adlx_int,
            function: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLMappingVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLMappingVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLMappingVtbl>(),
        64usize,
        "Size of IADLMappingVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLMappingVtbl>(),
        8usize,
        "Alignment of IADLMappingVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetADLXGPUFromBdf) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLMappingVtbl::GetADLXGPUFromBdf"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).GetADLXGPUFromAdlAdapterIndex) as usize - ptr as usize
        },
        8usize,
        "Offset of field: IADLMappingVtbl::GetADLXGPUFromAdlAdapterIndex"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BdfFromADLXGPU) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLMappingVtbl::BdfFromADLXGPU"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AdlAdapterIndexFromADLXGPU) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLMappingVtbl::AdlAdapterIndexFromADLXGPU"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetADLXDisplayFromADLIds) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLMappingVtbl::GetADLXDisplayFromADLIds"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ADLIdsFromADLXDisplay) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLMappingVtbl::ADLIdsFromADLXDisplay"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetADLXDesktopFromADLIds) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLMappingVtbl::GetADLXDesktopFromADLIds"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ADLIdsFromADLXDesktop) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLMappingVtbl::ADLIdsFromADLXDesktop"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLMapping {
    pub pVtbl: *const IADLMappingVtbl,
}
#[test]
fn bindgen_test_layout_IADLMapping() {
    const UNINIT: ::std::mem::MaybeUninit<IADLMapping> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLMapping>(),
        8usize,
        "Size of IADLMapping"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLMapping>(),
        8usize,
        "Alignment of IADLMapping"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLMapping::pVtbl"
    );
}
pub type ADLXQueryFullVersion_Fn =
    ::std::option::Option<unsafe extern "C" fn(fullVersion: *mut adlx_uint64) -> ADLX_RESULT>;
pub type ADLXQueryVersion_Fn = ::std::option::Option<
    unsafe extern "C" fn(version: *mut *const ::std::os::raw::c_char) -> ADLX_RESULT,
>;
#[doc = " @typedef ADLX_ADL_Main_Memory_Free\n @ingroup ADLXDefs\n @ENG_START_DOX The typedef of ADLX_ADL_Main_Memory_Free function. @ENG_END_DOX\n @definition\n  @codeStart\n   typedef void (ADLX_STD_CALL* ADLX_ADL_Main_Memory_Free)(void** buffer)\n  @codeEnd"]
pub type ADLX_ADL_Main_Memory_Free =
    ::std::option::Option<unsafe extern "C" fn(buffer: *mut *mut ::std::os::raw::c_void)>;
pub type ADLXInitialize_Fn = ::std::option::Option<
    unsafe extern "C" fn(version: adlx_uint64, ppSystem: *mut *mut IADLXSystem) -> ADLX_RESULT,
>;
pub type ADLXInitializeWithCallerAdl_Fn = ::std::option::Option<
    unsafe extern "C" fn(
        version: adlx_uint64,
        ppSystem: *mut *mut IADLXSystem,
        ppAdlMapping: *mut *mut IADLMapping,
        adlContext: adlx_handle,
        adlMainMemoryFree: ADLX_ADL_Main_Memory_Free,
    ) -> ADLX_RESULT,
>;
pub type ADLXTerminate_Fn = ::std::option::Option<unsafe extern "C" fn() -> ADLX_RESULT>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPU1Vtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPU1) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPU1) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub VendorId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            vendorId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub ASICFamilyType: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            asicFamilyType: *mut ADLX_ASIC_FAMILY_TYPE,
        ) -> ADLX_RESULT,
    >,
    pub Type: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU1, gpuType: *mut ADLX_GPU_TYPE) -> ADLX_RESULT,
    >,
    pub IsExternal: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU1, isExternal: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub Name: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            gpuName: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub DriverPath: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            driverPath: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub PNPString: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            pnpString: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub HasDesktops: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU1, hasDesktops: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub TotalVRAM: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU1, vramMB: *mut adlx_uint) -> ADLX_RESULT,
    >,
    pub VRAMType: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            type_: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub BIOSInfo: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            partNumber: *mut *const ::std::os::raw::c_char,
            version: *mut *const ::std::os::raw::c_char,
            date: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub DeviceId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            deviceId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub RevisionId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            revisionId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub SubSystemId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            subSystemId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub SubSystemVendorId: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            subSystemVendorId: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
    pub UniqueId: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU1, uniqueId: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub PCIBusType: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU1, busType: *mut ADLX_PCI_BUS_TYPE) -> ADLX_RESULT,
    >,
    pub PCIBusLaneWidth: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU1, laneWidth: *mut adlx_uint) -> ADLX_RESULT,
    >,
    pub MultiGPUMode: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPU1, mode: *mut ADLX_MGPU_MODE) -> ADLX_RESULT,
    >,
    pub ProductName: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPU1,
            productName: *mut *const ::std::os::raw::c_char,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPU1Vtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPU1Vtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPU1Vtbl>(),
        184usize,
        "Size of IADLXGPU1Vtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPU1Vtbl>(),
        8usize,
        "Alignment of IADLXGPU1Vtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPU1Vtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXGPU1Vtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXGPU1Vtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VendorId) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXGPU1Vtbl::VendorId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ASICFamilyType) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXGPU1Vtbl::ASICFamilyType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXGPU1Vtbl::Type"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsExternal) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXGPU1Vtbl::IsExternal"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXGPU1Vtbl::Name"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DriverPath) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXGPU1Vtbl::DriverPath"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PNPString) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXGPU1Vtbl::PNPString"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HasDesktops) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXGPU1Vtbl::HasDesktops"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TotalVRAM) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXGPU1Vtbl::TotalVRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).VRAMType) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXGPU1Vtbl::VRAMType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).BIOSInfo) as usize - ptr as usize },
        104usize,
        "Offset of field: IADLXGPU1Vtbl::BIOSInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeviceId) as usize - ptr as usize },
        112usize,
        "Offset of field: IADLXGPU1Vtbl::DeviceId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RevisionId) as usize - ptr as usize },
        120usize,
        "Offset of field: IADLXGPU1Vtbl::RevisionId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SubSystemId) as usize - ptr as usize },
        128usize,
        "Offset of field: IADLXGPU1Vtbl::SubSystemId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SubSystemVendorId) as usize - ptr as usize },
        136usize,
        "Offset of field: IADLXGPU1Vtbl::SubSystemVendorId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UniqueId) as usize - ptr as usize },
        144usize,
        "Offset of field: IADLXGPU1Vtbl::UniqueId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PCIBusType) as usize - ptr as usize },
        152usize,
        "Offset of field: IADLXGPU1Vtbl::PCIBusType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PCIBusLaneWidth) as usize - ptr as usize },
        160usize,
        "Offset of field: IADLXGPU1Vtbl::PCIBusLaneWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MultiGPUMode) as usize - ptr as usize },
        168usize,
        "Offset of field: IADLXGPU1Vtbl::MultiGPUMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProductName) as usize - ptr as usize },
        176usize,
        "Offset of field: IADLXGPU1Vtbl::ProductName"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPU1 {
    pub pVtbl: *const IADLXGPU1Vtbl,
}
#[test]
fn bindgen_test_layout_IADLXGPU1() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPU1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPU1>(),
        8usize,
        "Size of IADLXGPU1"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPU1>(),
        8usize,
        "Alignment of IADLXGPU1"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPU1::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXPowerTuningServices {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystem1Vtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXSystem1) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXSystem1) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem1,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub GetPowerTuningServices: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystem1,
            ppPowerTuningServices: *mut *mut IADLXPowerTuningServices,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXSystem1Vtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystem1Vtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystem1Vtbl>(),
        32usize,
        "Size of IADLXSystem1Vtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystem1Vtbl>(),
        8usize,
        "Alignment of IADLXSystem1Vtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystem1Vtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXSystem1Vtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXSystem1Vtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetPowerTuningServices) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXSystem1Vtbl::GetPowerTuningServices"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystem1 {
    pub pVtbl: *const IADLXSystem1Vtbl,
}
#[test]
fn bindgen_test_layout_IADLXSystem1() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystem1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystem1>(),
        8usize,
        "Size of IADLXSystem1"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystem1>(),
        8usize,
        "Alignment of IADLXSystem1"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystem1::pVtbl"
    );
}
#[doc = " @struct ADLX_RGB\n @ingroup structuresVal\n @ENG_START_DOX\n @brief This structure contains RGB information.\n @ENG_END_DOX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_RGB {
    #[doc = "< @ENG_START_DOX Red @ENG_END_DOX"]
    pub gamutR: adlx_double,
    #[doc = "< @ENG_START_DOX Green @ENG_END_DOX"]
    pub gamutG: adlx_double,
    #[doc = "< @ENG_START_DOX Blue @ENG_END_DOX"]
    pub gamutB: adlx_double,
}
#[test]
fn bindgen_test_layout_ADLX_RGB() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_RGB> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_RGB>(),
        24usize,
        "Size of ADLX_RGB"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_RGB>(),
        8usize,
        "Alignment of ADLX_RGB"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gamutR) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_RGB::gamutR"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gamutG) as usize - ptr as usize },
        8usize,
        "Offset of field: ADLX_RGB::gamutG"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gamutB) as usize - ptr as usize },
        16usize,
        "Offset of field: ADLX_RGB::gamutB"
    );
}
#[doc = "  @struct ADLX_Point\n  @ingroup structuresVal\n  @ENG_START_DOX\n  @brief This structure contains information on driver point coordinates, and is used to store the driver-point coodinates for gamut, as well as white point.\n  @ENG_END_DOX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_Point {
    #[doc = "< @ENG_START_DOX The x coordinate. @ENG_END_DOX"]
    pub x: adlx_int,
    #[doc = "< @ENG_START_DOX The y coordinate. @ENG_END_DOX"]
    pub y: adlx_int,
}
#[test]
fn bindgen_test_layout_ADLX_Point() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_Point> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_Point>(),
        8usize,
        "Size of ADLX_Point"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_Point>(),
        4usize,
        "Alignment of ADLX_Point"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_Point::x"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        "Offset of field: ADLX_Point::y"
    );
}
#[doc = "  @struct ADLX_GamutColorSpace\n  @ingroup structuresVal\n  @ENG_START_DOX\n  @brief This structure contains information on driver-supported gamut coordinates\n  @ENG_END_DOX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_GamutColorSpace {
    #[doc = "<  @ENG_START_DOX The red channel chromaticity coordinate. @ENG_END_DOX"]
    pub red: ADLX_Point,
    #[doc = "<  @ENG_START_DOX The green channel chromaticity coordinate. @ENG_END_DOX"]
    pub green: ADLX_Point,
    #[doc = "<  @ENG_START_DOX The blue channel chromaticity coordinate. @ENG_END_DOX"]
    pub blue: ADLX_Point,
}
#[test]
fn bindgen_test_layout_ADLX_GamutColorSpace() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_GamutColorSpace> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_GamutColorSpace>(),
        24usize,
        "Size of ADLX_GamutColorSpace"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_GamutColorSpace>(),
        4usize,
        "Alignment of ADLX_GamutColorSpace"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).red) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_GamutColorSpace::red"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).green) as usize - ptr as usize },
        8usize,
        "Offset of field: ADLX_GamutColorSpace::green"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blue) as usize - ptr as usize },
        16usize,
        "Offset of field: ADLX_GamutColorSpace::blue"
    );
}
#[doc = "  @struct ADLX_GammaRamp\n  @ingroup structuresVal\n  @ENG_START_DOX\n  @brief This structure contains the display gamma ramp used to program the re-gamma LUT.\n  @ENG_END_DOX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_GammaRamp {
    #[doc = "< @ENG_START_DOX The gamma ramp is a buffer containing 256 triplets of adlx_uint16 values.\nEach triplet consists of red, green and blue values. @ENG_END_DOX"]
    pub gamma: [adlx_uint16; 768usize],
}
#[test]
fn bindgen_test_layout_ADLX_GammaRamp() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_GammaRamp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_GammaRamp>(),
        1536usize,
        "Size of ADLX_GammaRamp"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_GammaRamp>(),
        2usize,
        "Alignment of ADLX_GammaRamp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gamma) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_GammaRamp::gamma"
    );
}
#[doc = "  @struct ADLX_RegammaCoeff\n  @ingroup structuresVal\n  @ENG_START_DOX\n  @brief This structure contains information on driver-supported re-gamma coefficients used to build the re-gamma curve.\n  @ENG_END_DOX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_RegammaCoeff {
    #[doc = "<  @ENG_START_DOX The a0 gamma coefficient. @ENG_END_DOX"]
    pub coefficientA0: adlx_int,
    #[doc = "<  @ENG_START_DOX The a1 gamma coefficient. @ENG_END_DOX"]
    pub coefficientA1: adlx_int,
    #[doc = "<  @ENG_START_DOX The a2 gamma coefficient. @ENG_END_DOX"]
    pub coefficientA2: adlx_int,
    #[doc = "<  @ENG_START_DOX The a3 gamma coefficient. @ENG_END_DOX"]
    pub coefficientA3: adlx_int,
    #[doc = "<  @ENG_START_DOX The regamma divider. @ENG_END_DOX"]
    pub gamma: adlx_int,
}
#[test]
fn bindgen_test_layout_ADLX_RegammaCoeff() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_RegammaCoeff> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_RegammaCoeff>(),
        20usize,
        "Size of ADLX_RegammaCoeff"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_RegammaCoeff>(),
        4usize,
        "Alignment of ADLX_RegammaCoeff"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coefficientA0) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_RegammaCoeff::coefficientA0"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coefficientA1) as usize - ptr as usize },
        4usize,
        "Offset of field: ADLX_RegammaCoeff::coefficientA1"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coefficientA2) as usize - ptr as usize },
        8usize,
        "Offset of field: ADLX_RegammaCoeff::coefficientA2"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coefficientA3) as usize - ptr as usize },
        12usize,
        "Offset of field: ADLX_RegammaCoeff::coefficientA3"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gamma) as usize - ptr as usize },
        16usize,
        "Offset of field: ADLX_RegammaCoeff::gamma"
    );
}
#[doc = "  @struct ADLX_TimingInfo\n  @ingroup structuresVal\n  @ENG_START_DOX\n  @brief This structure contains display timing information.\n  @ENG_END_DOX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_TimingInfo {
    #[doc = "< @ENG_START_DOX The detailed timing flag. @ENG_END_DOX"]
    pub timingFlags: adlx_int,
    #[doc = "< @ENG_START_DOX The total number of pixels that compose all scan lines during a horizontal sync. @ENG_END_DOX"]
    pub hTotal: adlx_int,
    #[doc = "< @ENG_START_DOX The total number of vertical pixels permitted/processed per sync. @ENG_END_DOX"]
    pub vTotal: adlx_int,
    #[doc = "< @ENG_START_DOX The number of horizontal pixels within the active area. @ENG_END_DOX"]
    pub hDisplay: adlx_int,
    #[doc = "< @ENG_START_DOX The number of vertical pixels within the active display area. @ENG_END_DOX"]
    pub vDisplay: adlx_int,
    #[doc = "< @ENG_START_DOX The number of horizontal pixels between the end of the active area and the next sync. This is the distance between the right/bottom portion of the display up to the right/bottom portion of the actual image. @ENG_END_DOX"]
    pub hFrontPorch: adlx_int,
    #[doc = "< @ENG_START_DOX The number of vertical pixels between the end of the active area and the next sync. This is the distance between the right/bottom portion of the display to the right/bottom portion of the actual image. @ENG_END_DOX"]
    pub vFrontPorch: adlx_int,
    #[doc = "< @ENG_START_DOX The number of pixels that compose a scan line during a horizontal sync. @ENG_END_DOX"]
    pub hSyncWidth: adlx_int,
    #[doc = "< @ENG_START_DOX The number of vertical pixels permitted/processed during a sync. @ENG_END_DOX"]
    pub vSyncWidth: adlx_int,
    #[doc = "< @ENG_START_DOX The horizontal polarity of sync signals, 0 POSITIVE; 1 NEGATIVE. Positive makes the active signals high while negative makes the active signals low. @ENG_END_DOX"]
    pub hPolarity: adlx_int,
    #[doc = "< @ENG_START_DOX The vertical polarity of sync signals, 0 POSITIVE; 1 NEGATIVE. Positive makes the active signals high while negative makes the active signals low. @ENG_END_DOX"]
    pub vPolarity: adlx_int,
}
#[test]
fn bindgen_test_layout_ADLX_TimingInfo() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_TimingInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_TimingInfo>(),
        44usize,
        "Size of ADLX_TimingInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_TimingInfo>(),
        4usize,
        "Alignment of ADLX_TimingInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timingFlags) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_TimingInfo::timingFlags"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hTotal) as usize - ptr as usize },
        4usize,
        "Offset of field: ADLX_TimingInfo::hTotal"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vTotal) as usize - ptr as usize },
        8usize,
        "Offset of field: ADLX_TimingInfo::vTotal"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hDisplay) as usize - ptr as usize },
        12usize,
        "Offset of field: ADLX_TimingInfo::hDisplay"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vDisplay) as usize - ptr as usize },
        16usize,
        "Offset of field: ADLX_TimingInfo::vDisplay"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hFrontPorch) as usize - ptr as usize },
        20usize,
        "Offset of field: ADLX_TimingInfo::hFrontPorch"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vFrontPorch) as usize - ptr as usize },
        24usize,
        "Offset of field: ADLX_TimingInfo::vFrontPorch"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hSyncWidth) as usize - ptr as usize },
        28usize,
        "Offset of field: ADLX_TimingInfo::hSyncWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vSyncWidth) as usize - ptr as usize },
        32usize,
        "Offset of field: ADLX_TimingInfo::vSyncWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hPolarity) as usize - ptr as usize },
        36usize,
        "Offset of field: ADLX_TimingInfo::hPolarity"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vPolarity) as usize - ptr as usize },
        40usize,
        "Offset of field: ADLX_TimingInfo::vPolarity"
    );
}
#[doc = " @struct ADLX_CustomResolution\n  @ingroup structuresVal\n @ENG_START_DOX\n  @brief This structure contains information for custom resolution parameters on a given display.\n @ENG_END_DOX\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_CustomResolution {
    #[doc = "< @ENG_START_DOX The resolution width. @ENG_END_DOX"]
    pub resWidth: adlx_int,
    #[doc = "< @ENG_START_DOX The resolution height. @ENG_END_DOX"]
    pub resHeight: adlx_int,
    #[doc = "< @ENG_START_DOX The refresh rate. @ENG_END_DOX"]
    pub refreshRate: adlx_int,
    #[doc = "< @ENG_START_DOX The presentation method, 0 PROGRESSIVE; 1 INTERLACED. @ENG_END_DOX"]
    pub presentation: ADLX_DISPLAY_SCAN_TYPE,
    #[doc = "< @ENG_START_DOX The display timing standard. @ENG_END_DOX"]
    pub timingStandard: ADLX_TIMING_STANDARD,
    #[doc = "< @ENG_START_DOX The speed at which pixels are transmitted within on a refresh cycle. @ENG_END_DOX"]
    pub GPixelClock: adlx_long,
    #[doc = "< @ENG_START_DOX The detailed timing information. @ENG_END_DOX"]
    pub detailedTiming: ADLX_TimingInfo,
}
#[test]
fn bindgen_test_layout_ADLX_CustomResolution() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_CustomResolution> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_CustomResolution>(),
        68usize,
        "Size of ADLX_CustomResolution"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_CustomResolution>(),
        4usize,
        "Alignment of ADLX_CustomResolution"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resWidth) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_CustomResolution::resWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resHeight) as usize - ptr as usize },
        4usize,
        "Offset of field: ADLX_CustomResolution::resHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refreshRate) as usize - ptr as usize },
        8usize,
        "Offset of field: ADLX_CustomResolution::refreshRate"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).presentation) as usize - ptr as usize },
        12usize,
        "Offset of field: ADLX_CustomResolution::presentation"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timingStandard) as usize - ptr as usize },
        16usize,
        "Offset of field: ADLX_CustomResolution::timingStandard"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPixelClock) as usize - ptr as usize },
        20usize,
        "Offset of field: ADLX_CustomResolution::GPixelClock"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).detailedTiming) as usize - ptr as usize },
        24usize,
        "Offset of field: ADLX_CustomResolution::detailedTiming"
    );
}
#[doc = " @struct ADLX_IntRange\n  @ingroup structuresVal\n @ENG_START_DOX\n  @brief This structure contains information on the integer range.\n @ENG_END_DOX\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_IntRange {
    #[doc = "< @ENG_START_DOX The minimum integer value. @ENG_END_DOX"]
    pub minValue: adlx_int,
    #[doc = "< @ENG_START_DOX The maximum integer value. @ENG_END_DOX"]
    pub maxValue: adlx_int,
    #[doc = "< @ENG_START_DOX The accepted integer range step. @ENG_END_DOX"]
    pub step: adlx_int,
}
#[test]
fn bindgen_test_layout_ADLX_IntRange() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_IntRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_IntRange>(),
        12usize,
        "Size of ADLX_IntRange"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_IntRange>(),
        4usize,
        "Alignment of ADLX_IntRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minValue) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_IntRange::minValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxValue) as usize - ptr as usize },
        4usize,
        "Offset of field: ADLX_IntRange::maxValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        8usize,
        "Offset of field: ADLX_IntRange::step"
    );
}
#[doc = " @struct ADLX_UINT16_RGB\n  @ingroup structuresVal\n @ENG_START_DOX\n  @brief This structure contains UINT16 RGB information.\n @ENG_END_DOX\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_UINT16_RGB {
    #[doc = "< @ENG_START_DOX Red @ENG_END_DOX"]
    pub red: adlx_uint16,
    #[doc = "< @ENG_START_DOX Green @ENG_END_DOX"]
    pub green: adlx_uint16,
    #[doc = "< @ENG_START_DOX Blue @ENG_END_DOX"]
    pub blue: adlx_uint16,
}
#[test]
fn bindgen_test_layout_ADLX_UINT16_RGB() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_UINT16_RGB> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_UINT16_RGB>(),
        6usize,
        "Size of ADLX_UINT16_RGB"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_UINT16_RGB>(),
        2usize,
        "Alignment of ADLX_UINT16_RGB"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).red) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_UINT16_RGB::red"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).green) as usize - ptr as usize },
        2usize,
        "Offset of field: ADLX_UINT16_RGB::green"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blue) as usize - ptr as usize },
        4usize,
        "Offset of field: ADLX_UINT16_RGB::blue"
    );
}
#[doc = " @struct ADLX_3DLUT_Data\n  @ingroup structuresVal\n @ENG_START_DOX\n  @brief This structure contains custom 3D LUT information.\n @ENG_END_DOX\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_3DLUT_Data {
    #[doc = "< @ENG_START_DOX The data is a buffer containing 17*17*17 triplets of @ref ADLX_UINT16_RGB values. Each triplet consists of red, green and blue values.\nFor 3D LUT data we use ushort 0 - 0xFFFF, data must be zero-padded to 16-bit. @ENG_END_DOX"]
    pub data: [ADLX_UINT16_RGB; 4913usize],
}
#[test]
fn bindgen_test_layout_ADLX_3DLUT_Data() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_3DLUT_Data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_3DLUT_Data>(),
        29478usize,
        "Size of ADLX_3DLUT_Data"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_3DLUT_Data>(),
        2usize,
        "Alignment of ADLX_3DLUT_Data"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_3DLUT_Data::data"
    );
}
#[doc = " @struct ADLX_LUID\n @ingroup structuresVal\n @ENG_START_DOX\n @brief This structure contains the local identifier information of the adapter.\n @ENG_END_DOX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ADLX_LUID {
    #[doc = "< @ENG_START_DOX Specifies the low part of the local id. @ENG_END_DOX"]
    pub lowPart: adlx_ulong,
    #[doc = "< @ENG_START_DOX Specifies the high part of the local id. @ENG_END_DOX"]
    pub highPart: adlx_long,
}
#[test]
fn bindgen_test_layout_ADLX_LUID() {
    const UNINIT: ::std::mem::MaybeUninit<ADLX_LUID> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ADLX_LUID>(),
        8usize,
        "Size of ADLX_LUID"
    );
    assert_eq!(
        ::std::mem::align_of::<ADLX_LUID>(),
        4usize,
        "Alignment of ADLX_LUID"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lowPart) as usize - ptr as usize },
        0usize,
        "Offset of field: ADLX_LUID::lowPart"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).highPart) as usize - ptr as usize },
        4usize,
        "Offset of field: ADLX_LUID::highPart"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUMetricsSupportVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsSupport) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsSupport) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUUsage: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUClockSpeed: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUVRAMClockSpeed: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUTemperature: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUHotspotTemperature: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUPower: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUTotalBoardPower: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUFanSpeed: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUVRAM: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUVoltage: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUUsageRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUClockSpeedRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUVRAMClockSpeedRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUTemperatureRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUHotspotTemperatureRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUPowerRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUFanSpeedRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUVRAMRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUVoltageRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUTotalBoardPowerRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUIntakeTemperatureRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedGPUIntakeTemperature: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPUMetricsSupportVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUMetricsSupportVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUMetricsSupportVtbl>(),
        200usize,
        "Size of IADLXGPUMetricsSupportVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUMetricsSupportVtbl>(),
        8usize,
        "Alignment of IADLXGPUMetricsSupportVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedGPUUsage) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUUsage"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedGPUClockSpeed) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUClockSpeed"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsSupportedGPUVRAMClockSpeed) as usize - ptr as usize
        },
        40usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUVRAMClockSpeed"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedGPUTemperature) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUTemperature"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsSupportedGPUHotspotTemperature) as usize - ptr as usize
        },
        56usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUHotspotTemperature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedGPUPower) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUPower"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsSupportedGPUTotalBoardPower) as usize - ptr as usize
        },
        72usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUTotalBoardPower"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedGPUFanSpeed) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUFanSpeed"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedGPUVRAM) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUVRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedGPUVoltage) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUVoltage"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUUsageRange) as usize - ptr as usize },
        104usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUUsageRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUClockSpeedRange) as usize - ptr as usize },
        112usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUClockSpeedRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUVRAMClockSpeedRange) as usize - ptr as usize },
        120usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUVRAMClockSpeedRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUTemperatureRange) as usize - ptr as usize },
        128usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUTemperatureRange"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).GetGPUHotspotTemperatureRange) as usize - ptr as usize
        },
        136usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUHotspotTemperatureRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUPowerRange) as usize - ptr as usize },
        144usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUPowerRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUFanSpeedRange) as usize - ptr as usize },
        152usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUFanSpeedRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUVRAMRange) as usize - ptr as usize },
        160usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUVRAMRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUVoltageRange) as usize - ptr as usize },
        168usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUVoltageRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUTotalBoardPowerRange) as usize - ptr as usize },
        176usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUTotalBoardPowerRange"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).GetGPUIntakeTemperatureRange) as usize - ptr as usize
        },
        184usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::GetGPUIntakeTemperatureRange"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsSupportedGPUIntakeTemperature) as usize - ptr as usize
        },
        192usize,
        "Offset of field: IADLXGPUMetricsSupportVtbl::IsSupportedGPUIntakeTemperature"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUMetricsSupport {
    pub pVtbl: *const IADLXGPUMetricsSupportVtbl,
}
#[test]
fn bindgen_test_layout_IADLXGPUMetricsSupport() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUMetricsSupport> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUMetricsSupport>(),
        8usize,
        "Size of IADLXGPUMetricsSupport"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUMetricsSupport>(),
        8usize,
        "Alignment of IADLXGPUMetricsSupport"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUMetricsSupport::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetricsSupportVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsSupport) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsSupport) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedCPUUsage: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedSystemRAM: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedSmartShift: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetCPUUsageRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetSystemRAMRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetSmartShiftRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetricsSupportVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetricsSupportVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetricsSupportVtbl>(),
        72usize,
        "Size of IADLXSystemMetricsSupportVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetricsSupportVtbl>(),
        8usize,
        "Alignment of IADLXSystemMetricsSupportVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedCPUUsage) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::IsSupportedCPUUsage"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedSystemRAM) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::IsSupportedSystemRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedSmartShift) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::IsSupportedSmartShift"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCPUUsageRange) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::GetCPUUsageRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSystemRAMRange) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::GetSystemRAMRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSmartShiftRange) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXSystemMetricsSupportVtbl::GetSmartShiftRange"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetricsSupport {
    pub pVtbl: *const IADLXSystemMetricsSupportVtbl,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetricsSupport() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetricsSupport> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetricsSupport>(),
        8usize,
        "Size of IADLXSystemMetricsSupport"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetricsSupport>(),
        8usize,
        "Alignment of IADLXSystemMetricsSupport"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetricsSupport::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUMetricsVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetrics,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub TimeStamp: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, ms: *mut adlx_int64) -> ADLX_RESULT,
    >,
    pub GPUUsage: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_double) -> ADLX_RESULT,
    >,
    pub GPUClockSpeed: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub GPUVRAMClockSpeed: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub GPUTemperature: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_double) -> ADLX_RESULT,
    >,
    pub GPUHotspotTemperature: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_double) -> ADLX_RESULT,
    >,
    pub GPUPower: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_double) -> ADLX_RESULT,
    >,
    pub GPUTotalBoardPower: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_double) -> ADLX_RESULT,
    >,
    pub GPUFanSpeed: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub GPUVRAM: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub GPUVoltage: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub GPUIntakeTemperature: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXGPUMetrics, data: *mut adlx_double) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPUMetricsVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUMetricsVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUMetricsVtbl>(),
        120usize,
        "Size of IADLXGPUMetricsVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUMetricsVtbl>(),
        8usize,
        "Alignment of IADLXGPUMetricsVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUMetricsVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXGPUMetricsVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXGPUMetricsVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeStamp) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXGPUMetricsVtbl::TimeStamp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUUsage) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUUsage"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUClockSpeed) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUClockSpeed"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUVRAMClockSpeed) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUVRAMClockSpeed"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUTemperature) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUTemperature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUHotspotTemperature) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUHotspotTemperature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUPower) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUPower"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUTotalBoardPower) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUTotalBoardPower"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUFanSpeed) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUFanSpeed"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUVRAM) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUVRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUVoltage) as usize - ptr as usize },
        104usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUVoltage"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GPUIntakeTemperature) as usize - ptr as usize },
        112usize,
        "Offset of field: IADLXGPUMetricsVtbl::GPUIntakeTemperature"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUMetrics {
    pub pVtbl: *const IADLXGPUMetricsVtbl,
}
#[test]
fn bindgen_test_layout_IADLXGPUMetrics() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUMetrics> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUMetrics>(),
        8usize,
        "Size of IADLXGPUMetrics"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUMetrics>(),
        8usize,
        "Alignment of IADLXGPUMetrics"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUMetrics::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUMetricsListVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsList) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsList) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsList,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub Size:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsList) -> adlx_uint>,
    pub Empty:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsList) -> adlx_bool>,
    pub Begin:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsList) -> adlx_uint>,
    pub End:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsList) -> adlx_uint>,
    pub At: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub Clear:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsList) -> ADLX_RESULT>,
    pub Remove_Back:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXGPUMetricsList) -> ADLX_RESULT>,
    pub Add_Back: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsList,
            pItem: *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub At_GPUMetricsList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXGPUMetrics,
        ) -> ADLX_RESULT,
    >,
    pub Add_Back_GPUMetricsList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXGPUMetricsList,
            pItem: *mut IADLXGPUMetrics,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPUMetricsListVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUMetricsListVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUMetricsListVtbl>(),
        104usize,
        "Size of IADLXGPUMetricsListVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUMetricsListVtbl>(),
        8usize,
        "Alignment of IADLXGPUMetricsListVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXGPUMetricsListVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Empty) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Empty"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Begin) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Begin"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).End) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXGPUMetricsListVtbl::End"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXGPUMetricsListVtbl::At"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Clear) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Clear"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Remove_Back) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Remove_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Add_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At_GPUMetricsList) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXGPUMetricsListVtbl::At_GPUMetricsList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back_GPUMetricsList) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXGPUMetricsListVtbl::Add_Back_GPUMetricsList"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUMetricsList {
    pub pVtbl: *const IADLXGPUMetricsListVtbl,
}
#[test]
fn bindgen_test_layout_IADLXGPUMetricsList() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUMetricsList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUMetricsList>(),
        8usize,
        "Size of IADLXGPUMetricsList"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUMetricsList>(),
        8usize,
        "Alignment of IADLXGPUMetricsList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUMetricsList::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetricsVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetrics,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub TimeStamp: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics, ms: *mut adlx_int64) -> ADLX_RESULT,
    >,
    pub CPUUsage: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics, data: *mut adlx_double) -> ADLX_RESULT,
    >,
    pub SystemRAM: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics, data: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub SmartShift: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics, data: *mut adlx_int) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetricsVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetricsVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetricsVtbl>(),
        56usize,
        "Size of IADLXSystemMetricsVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetricsVtbl>(),
        8usize,
        "Alignment of IADLXSystemMetricsVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetricsVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXSystemMetricsVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXSystemMetricsVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeStamp) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXSystemMetricsVtbl::TimeStamp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CPUUsage) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXSystemMetricsVtbl::CPUUsage"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemRAM) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXSystemMetricsVtbl::SystemRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SmartShift) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXSystemMetricsVtbl::SmartShift"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetrics {
    pub pVtbl: *const IADLXSystemMetricsVtbl,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetrics() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetrics> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetrics>(),
        8usize,
        "Size of IADLXSystemMetrics"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetrics>(),
        8usize,
        "Alignment of IADLXSystemMetrics"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetrics::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetricsListVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsList) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsList) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsList,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub Size: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsList) -> adlx_uint,
    >,
    pub Empty: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsList) -> adlx_bool,
    >,
    pub Begin: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsList) -> adlx_uint,
    >,
    pub End: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsList) -> adlx_uint,
    >,
    pub At: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub Clear: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsList) -> ADLX_RESULT,
    >,
    pub Remove_Back: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsList) -> ADLX_RESULT,
    >,
    pub Add_Back: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsList,
            pItem: *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub At_SystemMetricsList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXSystemMetrics,
        ) -> ADLX_RESULT,
    >,
    pub Add_Back_SystemMetricsList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsList,
            pItem: *mut IADLXSystemMetrics,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetricsListVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetricsListVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetricsListVtbl>(),
        104usize,
        "Size of IADLXSystemMetricsListVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetricsListVtbl>(),
        8usize,
        "Alignment of IADLXSystemMetricsListVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXSystemMetricsListVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Empty) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Empty"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Begin) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Begin"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).End) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXSystemMetricsListVtbl::End"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXSystemMetricsListVtbl::At"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Clear) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Clear"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Remove_Back) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Remove_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Add_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At_SystemMetricsList) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXSystemMetricsListVtbl::At_SystemMetricsList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back_SystemMetricsList) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXSystemMetricsListVtbl::Add_Back_SystemMetricsList"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetricsList {
    pub pVtbl: *const IADLXSystemMetricsListVtbl,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetricsList() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetricsList> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetricsList>(),
        8usize,
        "Size of IADLXSystemMetricsList"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetricsList>(),
        8usize,
        "Alignment of IADLXSystemMetricsList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetricsList::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXFPSVtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPS) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPS) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXFPS,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub TimeStamp: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXFPS, ms: *mut adlx_int64) -> ADLX_RESULT,
    >,
    pub FPS: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXFPS, data: *mut adlx_int) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXFPSVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXFPSVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXFPSVtbl>(),
        40usize,
        "Size of IADLXFPSVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXFPSVtbl>(),
        8usize,
        "Alignment of IADLXFPSVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXFPSVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXFPSVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXFPSVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeStamp) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXFPSVtbl::TimeStamp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FPS) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXFPSVtbl::FPS"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXFPS {
    pub pVtbl: *const IADLXFPSVtbl,
}
#[test]
fn bindgen_test_layout_IADLXFPS() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXFPS> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXFPS>(),
        8usize,
        "Size of IADLXFPS"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXFPS>(),
        8usize,
        "Alignment of IADLXFPS"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXFPS::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXFPSListVtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPSList) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPSList) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXFPSList,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub Size: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPSList) -> adlx_uint>,
    pub Empty: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPSList) -> adlx_bool>,
    pub Begin: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPSList) -> adlx_uint>,
    pub End: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPSList) -> adlx_uint>,
    pub At: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXFPSList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub Clear: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPSList) -> ADLX_RESULT>,
    pub Remove_Back:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXFPSList) -> ADLX_RESULT>,
    pub Add_Back: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXFPSList, pItem: *mut IADLXInterface) -> ADLX_RESULT,
    >,
    pub At_FPSList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXFPSList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXFPS,
        ) -> ADLX_RESULT,
    >,
    pub Add_Back_FPSList: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXFPSList, pItem: *mut IADLXFPS) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXFPSListVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXFPSListVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXFPSListVtbl>(),
        104usize,
        "Size of IADLXFPSListVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXFPSListVtbl>(),
        8usize,
        "Alignment of IADLXFPSListVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXFPSListVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXFPSListVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXFPSListVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXFPSListVtbl::Size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Empty) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXFPSListVtbl::Empty"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Begin) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXFPSListVtbl::Begin"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).End) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXFPSListVtbl::End"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXFPSListVtbl::At"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Clear) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXFPSListVtbl::Clear"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Remove_Back) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXFPSListVtbl::Remove_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXFPSListVtbl::Add_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At_FPSList) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXFPSListVtbl::At_FPSList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back_FPSList) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXFPSListVtbl::Add_Back_FPSList"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXFPSList {
    pub pVtbl: *const IADLXFPSListVtbl,
}
#[test]
fn bindgen_test_layout_IADLXFPSList() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXFPSList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXFPSList>(),
        8usize,
        "Size of IADLXFPSList"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXFPSList>(),
        8usize,
        "Alignment of IADLXFPSList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXFPSList::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXAllMetricsVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetrics) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetrics) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetrics,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub TimeStamp: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXAllMetrics, ms: *mut adlx_int64) -> ADLX_RESULT,
    >,
    pub GetSystemMetrics: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetrics,
            metrics: *mut *mut IADLXSystemMetrics,
        ) -> ADLX_RESULT,
    >,
    pub GetFPS: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetrics,
            metrics: *mut *mut IADLXFPS,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUMetrics: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetrics,
            pGPU: *mut IADLXGPU,
            metrics: *mut *mut IADLXGPUMetrics,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXAllMetricsVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXAllMetricsVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXAllMetricsVtbl>(),
        56usize,
        "Size of IADLXAllMetricsVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXAllMetricsVtbl>(),
        8usize,
        "Alignment of IADLXAllMetricsVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXAllMetricsVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXAllMetricsVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXAllMetricsVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeStamp) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXAllMetricsVtbl::TimeStamp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSystemMetrics) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXAllMetricsVtbl::GetSystemMetrics"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFPS) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXAllMetricsVtbl::GetFPS"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUMetrics) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXAllMetricsVtbl::GetGPUMetrics"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXAllMetrics {
    pub pVtbl: *const IADLXAllMetricsVtbl,
}
#[test]
fn bindgen_test_layout_IADLXAllMetrics() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXAllMetrics> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXAllMetrics>(),
        8usize,
        "Size of IADLXAllMetrics"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXAllMetrics>(),
        8usize,
        "Alignment of IADLXAllMetrics"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXAllMetrics::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXAllMetricsListVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetricsList) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetricsList) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetricsList,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub Size:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetricsList) -> adlx_uint>,
    pub Empty:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetricsList) -> adlx_bool>,
    pub Begin:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetricsList) -> adlx_uint>,
    pub End:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetricsList) -> adlx_uint>,
    pub At: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetricsList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub Clear:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetricsList) -> ADLX_RESULT>,
    pub Remove_Back:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXAllMetricsList) -> ADLX_RESULT>,
    pub Add_Back: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetricsList,
            pItem: *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub At_AllMetricsList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetricsList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXAllMetrics,
        ) -> ADLX_RESULT,
    >,
    pub Add_Back_AllMetricsList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXAllMetricsList,
            pItem: *mut IADLXAllMetrics,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXAllMetricsListVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXAllMetricsListVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXAllMetricsListVtbl>(),
        104usize,
        "Size of IADLXAllMetricsListVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXAllMetricsListVtbl>(),
        8usize,
        "Alignment of IADLXAllMetricsListVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXAllMetricsListVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXAllMetricsListVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXAllMetricsListVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXAllMetricsListVtbl::Size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Empty) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXAllMetricsListVtbl::Empty"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Begin) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXAllMetricsListVtbl::Begin"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).End) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXAllMetricsListVtbl::End"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXAllMetricsListVtbl::At"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Clear) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXAllMetricsListVtbl::Clear"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Remove_Back) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXAllMetricsListVtbl::Remove_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXAllMetricsListVtbl::Add_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At_AllMetricsList) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXAllMetricsListVtbl::At_AllMetricsList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back_AllMetricsList) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXAllMetricsListVtbl::Add_Back_AllMetricsList"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXAllMetricsList {
    pub pVtbl: *const IADLXAllMetricsListVtbl,
}
#[test]
fn bindgen_test_layout_IADLXAllMetricsList() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXAllMetricsList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXAllMetricsList>(),
        8usize,
        "Size of IADLXAllMetricsList"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXAllMetricsList>(),
        8usize,
        "Alignment of IADLXAllMetricsList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXAllMetricsList::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXPerformanceMonitoringServicesVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXPerformanceMonitoringServices) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXPerformanceMonitoringServices) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub GetSamplingIntervalRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub SetSamplingInterval: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            intervalMs: adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetSamplingInterval: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            intervalMs: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetMaxPerformanceMetricsHistorySizeRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub SetMaxPerformanceMetricsHistorySize: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            sizeSec: adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetMaxPerformanceMetricsHistorySize: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            sizeSec: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub ClearPerformanceMetricsHistory: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXPerformanceMonitoringServices) -> ADLX_RESULT,
    >,
    pub GetCurrentPerformanceMetricsHistorySize: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            sizeSec: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub StartPerformanceMetricsTracking: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXPerformanceMonitoringServices) -> ADLX_RESULT,
    >,
    pub StopPerformanceMetricsTracking: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXPerformanceMonitoringServices) -> ADLX_RESULT,
    >,
    pub GetAllMetricsHistory: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            startMs: adlx_int,
            stopMs: adlx_int,
            ppMetricsList: *mut *mut IADLXAllMetricsList,
        ) -> ADLX_RESULT,
    >,
    pub GetGPUMetricsHistory: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            pGPU: *mut IADLXGPU,
            startMs: adlx_int,
            stopMs: adlx_int,
            ppMetricsList: *mut *mut IADLXGPUMetricsList,
        ) -> ADLX_RESULT,
    >,
    pub GetSystemMetricsHistory: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            startMs: adlx_int,
            stopMs: adlx_int,
            ppMetricsList: *mut *mut IADLXSystemMetricsList,
        ) -> ADLX_RESULT,
    >,
    pub GetFPSHistory: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            startMs: adlx_int,
            stopMs: adlx_int,
            ppMetricsList: *mut *mut IADLXFPSList,
        ) -> ADLX_RESULT,
    >,
    pub GetCurrentAllMetrics: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            ppMetrics: *mut *mut IADLXAllMetrics,
        ) -> ADLX_RESULT,
    >,
    pub GetCurrentGPUMetrics: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            pGPU: *mut IADLXGPU,
            ppMetrics: *mut *mut IADLXGPUMetrics,
        ) -> ADLX_RESULT,
    >,
    pub GetCurrentSystemMetrics: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            ppMetrics: *mut *mut IADLXSystemMetrics,
        ) -> ADLX_RESULT,
    >,
    pub GetCurrentFPS: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            ppMetrics: *mut *mut IADLXFPS,
        ) -> ADLX_RESULT,
    >,
    pub GetSupportedGPUMetrics: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            pGPU: *mut IADLXGPU,
            ppMetricsSupported: *mut *mut IADLXGPUMetricsSupport,
        ) -> ADLX_RESULT,
    >,
    pub GetSupportedSystemMetrics: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXPerformanceMonitoringServices,
            ppMetricsSupported: *mut *mut IADLXSystemMetricsSupport,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXPerformanceMonitoringServicesVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXPerformanceMonitoringServicesVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXPerformanceMonitoringServicesVtbl>(),
        184usize,
        "Size of IADLXPerformanceMonitoringServicesVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXPerformanceMonitoringServicesVtbl>(),
        8usize,
        "Alignment of IADLXPerformanceMonitoringServicesVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSamplingIntervalRange) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetSamplingIntervalRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetSamplingInterval) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::SetSamplingInterval"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSamplingInterval) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetSamplingInterval"
    );
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . GetMaxPerformanceMetricsHistorySizeRange) as usize - ptr as usize } , 48usize , "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetMaxPerformanceMetricsHistorySizeRange");
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . SetMaxPerformanceMetricsHistorySize) as usize - ptr as usize } , 56usize , "Offset of field: IADLXPerformanceMonitoringServicesVtbl::SetMaxPerformanceMetricsHistorySize");
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . GetMaxPerformanceMetricsHistorySize) as usize - ptr as usize } , 64usize , "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetMaxPerformanceMetricsHistorySize");
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).ClearPerformanceMetricsHistory) as usize - ptr as usize
        },
        72usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::ClearPerformanceMetricsHistory"
    );
    assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . GetCurrentPerformanceMetricsHistorySize) as usize - ptr as usize } , 80usize , "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetCurrentPerformanceMetricsHistorySize");
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).StartPerformanceMetricsTracking) as usize - ptr as usize
        },
        88usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::StartPerformanceMetricsTracking"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).StopPerformanceMetricsTracking) as usize - ptr as usize
        },
        96usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::StopPerformanceMetricsTracking"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetAllMetricsHistory) as usize - ptr as usize },
        104usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetAllMetricsHistory"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPUMetricsHistory) as usize - ptr as usize },
        112usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetGPUMetricsHistory"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSystemMetricsHistory) as usize - ptr as usize },
        120usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetSystemMetricsHistory"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFPSHistory) as usize - ptr as usize },
        128usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetFPSHistory"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCurrentAllMetrics) as usize - ptr as usize },
        136usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetCurrentAllMetrics"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCurrentGPUMetrics) as usize - ptr as usize },
        144usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetCurrentGPUMetrics"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCurrentSystemMetrics) as usize - ptr as usize },
        152usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetCurrentSystemMetrics"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCurrentFPS) as usize - ptr as usize },
        160usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetCurrentFPS"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSupportedGPUMetrics) as usize - ptr as usize },
        168usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetSupportedGPUMetrics"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSupportedSystemMetrics) as usize - ptr as usize },
        176usize,
        "Offset of field: IADLXPerformanceMonitoringServicesVtbl::GetSupportedSystemMetrics"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXPerformanceMonitoringServices {
    pub pVtbl: *const IADLXPerformanceMonitoringServicesVtbl,
}
#[test]
fn bindgen_test_layout_IADLXPerformanceMonitoringServices() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXPerformanceMonitoringServices> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXPerformanceMonitoringServices>(),
        8usize,
        "Size of IADLXPerformanceMonitoringServices"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXPerformanceMonitoringServices>(),
        8usize,
        "Alignment of IADLXPerformanceMonitoringServices"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXPerformanceMonitoringServices::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetricsSupport1Vtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsSupport1) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetricsSupport1) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport1,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedCPUUsage: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport1,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedSystemRAM: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport1,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedSmartShift: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport1,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetCPUUsageRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport1,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetSystemRAMRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport1,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub GetSmartShiftRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport1,
            minValue: *mut adlx_int,
            maxValue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedPowerDistribution: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetricsSupport1,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetricsSupport1Vtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetricsSupport1Vtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetricsSupport1Vtbl>(),
        80usize,
        "Size of IADLXSystemMetricsSupport1Vtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetricsSupport1Vtbl>(),
        8usize,
        "Alignment of IADLXSystemMetricsSupport1Vtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedCPUUsage) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::IsSupportedCPUUsage"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedSystemRAM) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::IsSupportedSystemRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedSmartShift) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::IsSupportedSmartShift"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCPUUsageRange) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::GetCPUUsageRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSystemRAMRange) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::GetSystemRAMRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSmartShiftRange) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::GetSmartShiftRange"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsSupportedPowerDistribution) as usize - ptr as usize
        },
        72usize,
        "Offset of field: IADLXSystemMetricsSupport1Vtbl::IsSupportedPowerDistribution"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetricsSupport1 {
    pub pVtbl: *const IADLXSystemMetricsSupport1Vtbl,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetricsSupport1() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetricsSupport1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetricsSupport1>(),
        8usize,
        "Size of IADLXSystemMetricsSupport1"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetricsSupport1>(),
        8usize,
        "Alignment of IADLXSystemMetricsSupport1"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetricsSupport1::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetrics1Vtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics1) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics1) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetrics1,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub TimeStamp: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics1, ms: *mut adlx_int64) -> ADLX_RESULT,
    >,
    pub CPUUsage: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetrics1,
            data: *mut adlx_double,
        ) -> ADLX_RESULT,
    >,
    pub SystemRAM: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics1, data: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub SmartShift: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXSystemMetrics1, data: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub PowerDistribution: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXSystemMetrics1,
            apuShiftValue: *mut adlx_int,
            gpuShiftValue: *mut adlx_int,
            apuShiftLimit: *mut adlx_int,
            gpuShiftLimit: *mut adlx_int,
            totalShiftLimit: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetrics1Vtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetrics1Vtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetrics1Vtbl>(),
        64usize,
        "Size of IADLXSystemMetrics1Vtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetrics1Vtbl>(),
        8usize,
        "Alignment of IADLXSystemMetrics1Vtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetrics1Vtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXSystemMetrics1Vtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXSystemMetrics1Vtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).TimeStamp) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXSystemMetrics1Vtbl::TimeStamp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CPUUsage) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXSystemMetrics1Vtbl::CPUUsage"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SystemRAM) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXSystemMetrics1Vtbl::SystemRAM"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SmartShift) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXSystemMetrics1Vtbl::SmartShift"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PowerDistribution) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXSystemMetrics1Vtbl::PowerDistribution"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXSystemMetrics1 {
    pub pVtbl: *const IADLXSystemMetrics1Vtbl,
}
#[test]
fn bindgen_test_layout_IADLXSystemMetrics1() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXSystemMetrics1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXSystemMetrics1>(),
        8usize,
        "Size of IADLXSystemMetrics1"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXSystemMetrics1>(),
        8usize,
        "Alignment of IADLXSystemMetrics1"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXSystemMetrics1::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXChangedEventVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXChangedEvent) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXChangedEvent) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXChangedEvent,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub GetOrigin: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXChangedEvent) -> ADLX_SYNC_ORIGIN,
    >,
}
#[test]
fn bindgen_test_layout_IADLXChangedEventVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXChangedEventVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXChangedEventVtbl>(),
        32usize,
        "Size of IADLXChangedEventVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXChangedEventVtbl>(),
        8usize,
        "Alignment of IADLXChangedEventVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXChangedEventVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXChangedEventVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXChangedEventVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetOrigin) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXChangedEventVtbl::GetOrigin"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXChangedEvent {
    pub pVtbl: *const IADLXChangedEventVtbl,
}
#[test]
fn bindgen_test_layout_IADLXChangedEvent() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXChangedEvent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXChangedEvent>(),
        8usize,
        "Size of IADLXChangedEvent"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXChangedEvent>(),
        8usize,
        "Alignment of IADLXChangedEvent"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXChangedEvent::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DAntiLagVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiLag,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag, supported: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag, enabled: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag, enable: adlx_bool) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DAntiLagVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DAntiLagVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DAntiLagVtbl>(),
        48usize,
        "Size of IADLX3DAntiLagVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DAntiLagVtbl>(),
        8usize,
        "Alignment of IADLX3DAntiLagVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DAntiLagVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DAntiLagVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DAntiLagVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DAntiLagVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DAntiLagVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DAntiLagVtbl::SetEnabled"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DAntiLag {
    pub pVtbl: *const IADLX3DAntiLagVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DAntiLag() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DAntiLag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DAntiLag>(),
        8usize,
        "Size of IADLX3DAntiLag"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DAntiLag>(),
        8usize,
        "Alignment of IADLX3DAntiLag"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DAntiLag::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DAntiLag1Vtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag1) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag1) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiLag1,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag1, supported: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag1, enabled: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag1, enable: adlx_bool) -> ADLX_RESULT,
    >,
    pub GetLevel: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiLag1,
            level: *mut ADLX_ANTILAG_STATE,
        ) -> ADLX_RESULT,
    >,
    pub SetLevel: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAntiLag1, level: ADLX_ANTILAG_STATE) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DAntiLag1Vtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DAntiLag1Vtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DAntiLag1Vtbl>(),
        64usize,
        "Size of IADLX3DAntiLag1Vtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DAntiLag1Vtbl>(),
        8usize,
        "Alignment of IADLX3DAntiLag1Vtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DAntiLag1Vtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DAntiLag1Vtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DAntiLag1Vtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DAntiLag1Vtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DAntiLag1Vtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DAntiLag1Vtbl::SetEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLevel) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DAntiLag1Vtbl::GetLevel"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLevel) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DAntiLag1Vtbl::SetLevel"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DAntiLag1 {
    pub pVtbl: *const IADLX3DAntiLag1Vtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DAntiLag1() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DAntiLag1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DAntiLag1>(),
        8usize,
        "Size of IADLX3DAntiLag1"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DAntiLag1>(),
        8usize,
        "Alignment of IADLX3DAntiLag1"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DAntiLag1::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DChillVtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DChill) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DChill) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DChill,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DChill, supported: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DChill, isEnabled: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub GetFPSRange: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DChill, range: *mut ADLX_IntRange) -> ADLX_RESULT,
    >,
    pub GetMinFPS: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DChill, currentMinFPS: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub GetMaxFPS: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DChill, currentMaxFPS: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DChill, enable: adlx_bool) -> ADLX_RESULT,
    >,
    pub SetMinFPS: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DChill, minFPS: adlx_int) -> ADLX_RESULT,
    >,
    pub SetMaxFPS: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DChill, maxFPS: adlx_int) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DChillVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DChillVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DChillVtbl>(),
        88usize,
        "Size of IADLX3DChillVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DChillVtbl>(),
        8usize,
        "Alignment of IADLX3DChillVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DChillVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DChillVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DChillVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DChillVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DChillVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFPSRange) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DChillVtbl::GetFPSRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMinFPS) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DChillVtbl::GetMinFPS"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMaxFPS) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DChillVtbl::GetMaxFPS"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX3DChillVtbl::SetEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetMinFPS) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLX3DChillVtbl::SetMinFPS"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetMaxFPS) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLX3DChillVtbl::SetMaxFPS"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DChill {
    pub pVtbl: *const IADLX3DChillVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DChill() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DChill> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DChill>(),
        8usize,
        "Size of IADLX3DChill"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DChill>(),
        8usize,
        "Alignment of IADLX3DChill"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DChill::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DBoostVtbl {
    pub Acquire: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DBoost) -> adlx_long>,
    pub Release: ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DBoost) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DBoost,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DBoost, supported: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DBoost, isEnabled: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub GetResolutionRange: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DBoost, range: *mut ADLX_IntRange) -> ADLX_RESULT,
    >,
    pub GetResolution: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DBoost, currentMinRes: *mut adlx_int) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DBoost, enable: adlx_bool) -> ADLX_RESULT,
    >,
    pub SetResolution: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DBoost, minRes: adlx_int) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DBoostVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DBoostVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DBoostVtbl>(),
        72usize,
        "Size of IADLX3DBoostVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DBoostVtbl>(),
        8usize,
        "Alignment of IADLX3DBoostVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DBoostVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DBoostVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DBoostVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DBoostVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DBoostVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetResolutionRange) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DBoostVtbl::GetResolutionRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetResolution) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DBoostVtbl::GetResolution"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DBoostVtbl::SetEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetResolution) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX3DBoostVtbl::SetResolution"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DBoost {
    pub pVtbl: *const IADLX3DBoostVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DBoost() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DBoost> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DBoost>(),
        8usize,
        "Size of IADLX3DBoost"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DBoost>(),
        8usize,
        "Alignment of IADLX3DBoost"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DBoost::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DImageSharpeningVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DImageSharpening) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DImageSharpening) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DImageSharpening,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DImageSharpening,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DImageSharpening,
            isEnabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetSharpnessRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DImageSharpening,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub GetSharpness: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DImageSharpening,
            currentSharpness: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DImageSharpening, enable: adlx_bool) -> ADLX_RESULT,
    >,
    pub SetSharpness: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DImageSharpening,
            sharpness: adlx_int,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DImageSharpeningVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DImageSharpeningVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DImageSharpeningVtbl>(),
        72usize,
        "Size of IADLX3DImageSharpeningVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DImageSharpeningVtbl>(),
        8usize,
        "Alignment of IADLX3DImageSharpeningVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSharpnessRange) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::GetSharpnessRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSharpness) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::GetSharpness"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::SetEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetSharpness) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX3DImageSharpeningVtbl::SetSharpness"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DImageSharpening {
    pub pVtbl: *const IADLX3DImageSharpeningVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DImageSharpening() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DImageSharpening> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DImageSharpening>(),
        8usize,
        "Size of IADLX3DImageSharpening"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DImageSharpening>(),
        8usize,
        "Alignment of IADLX3DImageSharpening"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DImageSharpening::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DEnhancedSyncVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DEnhancedSync) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DEnhancedSync) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DEnhancedSync,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DEnhancedSync,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DEnhancedSync,
            isEnabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DEnhancedSync, enable: adlx_bool) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DEnhancedSyncVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DEnhancedSyncVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DEnhancedSyncVtbl>(),
        48usize,
        "Size of IADLX3DEnhancedSyncVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DEnhancedSyncVtbl>(),
        8usize,
        "Alignment of IADLX3DEnhancedSyncVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DEnhancedSyncVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DEnhancedSyncVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DEnhancedSyncVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DEnhancedSyncVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DEnhancedSyncVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DEnhancedSyncVtbl::SetEnabled"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DEnhancedSync {
    pub pVtbl: *const IADLX3DEnhancedSyncVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DEnhancedSync() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DEnhancedSync> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DEnhancedSync>(),
        8usize,
        "Size of IADLX3DEnhancedSync"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DEnhancedSync>(),
        8usize,
        "Alignment of IADLX3DEnhancedSync"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DEnhancedSync::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DWaitForVerticalRefreshVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DWaitForVerticalRefresh) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DWaitForVerticalRefresh) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DWaitForVerticalRefresh,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DWaitForVerticalRefresh,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DWaitForVerticalRefresh,
            isEnabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetMode: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DWaitForVerticalRefresh,
            currentMode: *mut ADLX_WAIT_FOR_VERTICAL_REFRESH_MODE,
        ) -> ADLX_RESULT,
    >,
    pub SetMode: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DWaitForVerticalRefresh,
            mode: ADLX_WAIT_FOR_VERTICAL_REFRESH_MODE,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DWaitForVerticalRefreshVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DWaitForVerticalRefreshVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DWaitForVerticalRefreshVtbl>(),
        56usize,
        "Size of IADLX3DWaitForVerticalRefreshVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DWaitForVerticalRefreshVtbl>(),
        8usize,
        "Alignment of IADLX3DWaitForVerticalRefreshVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DWaitForVerticalRefreshVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DWaitForVerticalRefreshVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DWaitForVerticalRefreshVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DWaitForVerticalRefreshVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DWaitForVerticalRefreshVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMode) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DWaitForVerticalRefreshVtbl::GetMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetMode) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DWaitForVerticalRefreshVtbl::SetMode"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DWaitForVerticalRefresh {
    pub pVtbl: *const IADLX3DWaitForVerticalRefreshVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DWaitForVerticalRefresh() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DWaitForVerticalRefresh> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DWaitForVerticalRefresh>(),
        8usize,
        "Size of IADLX3DWaitForVerticalRefresh"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DWaitForVerticalRefresh>(),
        8usize,
        "Alignment of IADLX3DWaitForVerticalRefresh"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DWaitForVerticalRefresh::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DFrameRateTargetControlVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DFrameRateTargetControl) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DFrameRateTargetControl) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DFrameRateTargetControl,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DFrameRateTargetControl,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DFrameRateTargetControl,
            isEnabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetFPSRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DFrameRateTargetControl,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub GetFPS: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DFrameRateTargetControl,
            currentFPS: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DFrameRateTargetControl,
            enable: adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetFPS: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DFrameRateTargetControl,
            maxFPS: adlx_int,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DFrameRateTargetControlVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DFrameRateTargetControlVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DFrameRateTargetControlVtbl>(),
        72usize,
        "Size of IADLX3DFrameRateTargetControlVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DFrameRateTargetControlVtbl>(),
        8usize,
        "Alignment of IADLX3DFrameRateTargetControlVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFPSRange) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::GetFPSRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFPS) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::GetFPS"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::SetEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetFPS) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX3DFrameRateTargetControlVtbl::SetFPS"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DFrameRateTargetControl {
    pub pVtbl: *const IADLX3DFrameRateTargetControlVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DFrameRateTargetControl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DFrameRateTargetControl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DFrameRateTargetControl>(),
        8usize,
        "Size of IADLX3DFrameRateTargetControl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DFrameRateTargetControl>(),
        8usize,
        "Alignment of IADLX3DFrameRateTargetControl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DFrameRateTargetControl::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DAntiAliasingVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DAntiAliasing) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DAntiAliasing) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiAliasing,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiAliasing,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetMode: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiAliasing,
            currentMode: *mut ADLX_ANTI_ALIASING_MODE,
        ) -> ADLX_RESULT,
    >,
    pub GetLevel: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiAliasing,
            currentLevel: *mut ADLX_ANTI_ALIASING_LEVEL,
        ) -> ADLX_RESULT,
    >,
    pub GetMethod: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiAliasing,
            currentMethod: *mut ADLX_ANTI_ALIASING_METHOD,
        ) -> ADLX_RESULT,
    >,
    pub SetMode: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiAliasing,
            mode: ADLX_ANTI_ALIASING_MODE,
        ) -> ADLX_RESULT,
    >,
    pub SetLevel: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiAliasing,
            level: ADLX_ANTI_ALIASING_LEVEL,
        ) -> ADLX_RESULT,
    >,
    pub SetMethod: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAntiAliasing,
            method: ADLX_ANTI_ALIASING_METHOD,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DAntiAliasingVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DAntiAliasingVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DAntiAliasingVtbl>(),
        80usize,
        "Size of IADLX3DAntiAliasingVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DAntiAliasingVtbl>(),
        8usize,
        "Alignment of IADLX3DAntiAliasingVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMode) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::GetMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLevel) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::GetLevel"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMethod) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::GetMethod"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetMode) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::SetMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLevel) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::SetLevel"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetMethod) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLX3DAntiAliasingVtbl::SetMethod"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DAntiAliasing {
    pub pVtbl: *const IADLX3DAntiAliasingVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DAntiAliasing() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DAntiAliasing> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DAntiAliasing>(),
        8usize,
        "Size of IADLX3DAntiAliasing"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DAntiAliasing>(),
        8usize,
        "Alignment of IADLX3DAntiAliasing"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DAntiAliasing::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DMorphologicalAntiAliasingVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DMorphologicalAntiAliasing) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DMorphologicalAntiAliasing) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DMorphologicalAntiAliasing,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DMorphologicalAntiAliasing,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DMorphologicalAntiAliasing,
            isEnabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DMorphologicalAntiAliasing,
            enable: adlx_bool,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DMorphologicalAntiAliasingVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DMorphologicalAntiAliasingVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DMorphologicalAntiAliasingVtbl>(),
        48usize,
        "Size of IADLX3DMorphologicalAntiAliasingVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DMorphologicalAntiAliasingVtbl>(),
        8usize,
        "Alignment of IADLX3DMorphologicalAntiAliasingVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DMorphologicalAntiAliasingVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DMorphologicalAntiAliasingVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DMorphologicalAntiAliasingVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DMorphologicalAntiAliasingVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DMorphologicalAntiAliasingVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DMorphologicalAntiAliasingVtbl::SetEnabled"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DMorphologicalAntiAliasing {
    pub pVtbl: *const IADLX3DMorphologicalAntiAliasingVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DMorphologicalAntiAliasing() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DMorphologicalAntiAliasing> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DMorphologicalAntiAliasing>(),
        8usize,
        "Size of IADLX3DMorphologicalAntiAliasing"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DMorphologicalAntiAliasing>(),
        8usize,
        "Alignment of IADLX3DMorphologicalAntiAliasing"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DMorphologicalAntiAliasing::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DAnisotropicFilteringVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAnisotropicFiltering) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DAnisotropicFiltering) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAnisotropicFiltering,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAnisotropicFiltering,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAnisotropicFiltering,
            isEnabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetLevel: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAnisotropicFiltering,
            currentLevel: *mut ADLX_ANISOTROPIC_FILTERING_LEVEL,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAnisotropicFiltering,
            enable: adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetLevel: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DAnisotropicFiltering,
            level: ADLX_ANISOTROPIC_FILTERING_LEVEL,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DAnisotropicFilteringVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DAnisotropicFilteringVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DAnisotropicFilteringVtbl>(),
        64usize,
        "Size of IADLX3DAnisotropicFilteringVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DAnisotropicFilteringVtbl>(),
        8usize,
        "Alignment of IADLX3DAnisotropicFilteringVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DAnisotropicFilteringVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DAnisotropicFilteringVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DAnisotropicFilteringVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DAnisotropicFilteringVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DAnisotropicFilteringVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLevel) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DAnisotropicFilteringVtbl::GetLevel"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DAnisotropicFilteringVtbl::SetEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLevel) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DAnisotropicFilteringVtbl::SetLevel"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DAnisotropicFiltering {
    pub pVtbl: *const IADLX3DAnisotropicFilteringVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DAnisotropicFiltering() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DAnisotropicFiltering> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DAnisotropicFiltering>(),
        8usize,
        "Size of IADLX3DAnisotropicFiltering"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DAnisotropicFiltering>(),
        8usize,
        "Alignment of IADLX3DAnisotropicFiltering"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DAnisotropicFiltering::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DTessellationVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DTessellation) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLX3DTessellation) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DTessellation,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DTessellation,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetMode: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DTessellation,
            currentMode: *mut ADLX_TESSELLATION_MODE,
        ) -> ADLX_RESULT,
    >,
    pub GetLevel: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DTessellation,
            currentLevel: *mut ADLX_TESSELLATION_LEVEL,
        ) -> ADLX_RESULT,
    >,
    pub SetMode: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DTessellation,
            mode: ADLX_TESSELLATION_MODE,
        ) -> ADLX_RESULT,
    >,
    pub SetLevel: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DTessellation,
            level: ADLX_TESSELLATION_LEVEL,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DTessellationVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DTessellationVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DTessellationVtbl>(),
        64usize,
        "Size of IADLX3DTessellationVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DTessellationVtbl>(),
        8usize,
        "Alignment of IADLX3DTessellationVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DTessellationVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DTessellationVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DTessellationVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DTessellationVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMode) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DTessellationVtbl::GetMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLevel) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DTessellationVtbl::GetLevel"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetMode) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DTessellationVtbl::SetMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLevel) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DTessellationVtbl::SetLevel"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DTessellation {
    pub pVtbl: *const IADLX3DTessellationVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DTessellation() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DTessellation> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DTessellation>(),
        8usize,
        "Size of IADLX3DTessellation"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DTessellation>(),
        8usize,
        "Alignment of IADLX3DTessellation"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DTessellation::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DRadeonSuperResolutionVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DRadeonSuperResolution) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DRadeonSuperResolution) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DRadeonSuperResolution,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DRadeonSuperResolution,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DRadeonSuperResolution,
            enabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DRadeonSuperResolution,
            enable: adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetSharpnessRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DRadeonSuperResolution,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub GetSharpness: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DRadeonSuperResolution,
            currentSharpness: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub SetSharpness: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DRadeonSuperResolution,
            sharpness: adlx_int,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DRadeonSuperResolutionVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DRadeonSuperResolutionVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DRadeonSuperResolutionVtbl>(),
        72usize,
        "Size of IADLX3DRadeonSuperResolutionVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DRadeonSuperResolutionVtbl>(),
        8usize,
        "Alignment of IADLX3DRadeonSuperResolutionVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::SetEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSharpnessRange) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::GetSharpnessRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSharpness) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::GetSharpness"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetSharpness) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX3DRadeonSuperResolutionVtbl::SetSharpness"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DRadeonSuperResolution {
    pub pVtbl: *const IADLX3DRadeonSuperResolutionVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DRadeonSuperResolution() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DRadeonSuperResolution> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DRadeonSuperResolution>(),
        8usize,
        "Size of IADLX3DRadeonSuperResolution"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DRadeonSuperResolution>(),
        8usize,
        "Alignment of IADLX3DRadeonSuperResolution"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DRadeonSuperResolution::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DResetShaderCacheVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DResetShaderCache) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DResetShaderCache) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DResetShaderCache,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DResetShaderCache,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub ResetShaderCache: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DResetShaderCache) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DResetShaderCacheVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DResetShaderCacheVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DResetShaderCacheVtbl>(),
        40usize,
        "Size of IADLX3DResetShaderCacheVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DResetShaderCacheVtbl>(),
        8usize,
        "Alignment of IADLX3DResetShaderCacheVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DResetShaderCacheVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DResetShaderCacheVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DResetShaderCacheVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DResetShaderCacheVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResetShaderCache) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DResetShaderCacheVtbl::ResetShaderCache"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DResetShaderCache {
    pub pVtbl: *const IADLX3DResetShaderCacheVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DResetShaderCache() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DResetShaderCache> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DResetShaderCache>(),
        8usize,
        "Size of IADLX3DResetShaderCache"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DResetShaderCache>(),
        8usize,
        "Alignment of IADLX3DResetShaderCache"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DResetShaderCache::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DSettingsChangedEventVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsChangedEvent,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub GetOrigin: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> ADLX_SYNC_ORIGIN,
    >,
    pub GetGPU: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsChangedEvent,
            ppGPU: *mut *mut IADLXGPU,
        ) -> ADLX_RESULT,
    >,
    pub IsAntiLagChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsChillChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsBoostChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsImageSharpeningChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsEnhancedSyncChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsWaitForVerticalRefreshChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsFrameRateTargetControlChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsAntiAliasingChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsMorphologicalAntiAliasingChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsAnisotropicFilteringChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsTessellationModeChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsRadeonSuperResolutionChanged: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
    pub IsResetShaderCache: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedEvent) -> adlx_bool,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DSettingsChangedEventVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DSettingsChangedEventVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DSettingsChangedEventVtbl>(),
        144usize,
        "Size of IADLX3DSettingsChangedEventVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DSettingsChangedEventVtbl>(),
        8usize,
        "Alignment of IADLX3DSettingsChangedEventVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetOrigin) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::GetOrigin"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetGPU) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::GetGPU"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsAntiLagChanged) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsAntiLagChanged"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsChillChanged) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsChillChanged"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsBoostChanged) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsBoostChanged"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsImageSharpeningChanged) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsImageSharpeningChanged"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnhancedSyncChanged) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsEnhancedSyncChanged"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsWaitForVerticalRefreshChanged) as usize - ptr as usize
        },
        80usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsWaitForVerticalRefreshChanged"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsFrameRateTargetControlChanged) as usize - ptr as usize
        },
        88usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsFrameRateTargetControlChanged"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsAntiAliasingChanged) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsAntiAliasingChanged"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsMorphologicalAntiAliasingChanged) as usize - ptr as usize
        },
        104usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsMorphologicalAntiAliasingChanged"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsAnisotropicFilteringChanged) as usize - ptr as usize
        },
        112usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsAnisotropicFilteringChanged"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsTessellationModeChanged) as usize - ptr as usize },
        120usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsTessellationModeChanged"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).IsRadeonSuperResolutionChanged) as usize - ptr as usize
        },
        128usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsRadeonSuperResolutionChanged"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsResetShaderCache) as usize - ptr as usize },
        136usize,
        "Offset of field: IADLX3DSettingsChangedEventVtbl::IsResetShaderCache"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DSettingsChangedEvent {
    pub pVtbl: *const IADLX3DSettingsChangedEventVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DSettingsChangedEvent() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DSettingsChangedEvent> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DSettingsChangedEvent>(),
        8usize,
        "Size of IADLX3DSettingsChangedEvent"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DSettingsChangedEvent>(),
        8usize,
        "Alignment of IADLX3DSettingsChangedEvent"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DSettingsChangedEvent::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DSettingsChangedListenerVtbl {
    pub On3DSettingsChanged: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsChangedListener,
            p3DSettingsChangedEvent: *mut IADLX3DSettingsChangedEvent,
        ) -> adlx_bool,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DSettingsChangedListenerVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DSettingsChangedListenerVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DSettingsChangedListenerVtbl>(),
        8usize,
        "Size of IADLX3DSettingsChangedListenerVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DSettingsChangedListenerVtbl>(),
        8usize,
        "Alignment of IADLX3DSettingsChangedListenerVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).On3DSettingsChanged) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DSettingsChangedListenerVtbl::On3DSettingsChanged"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DSettingsChangedListener {
    pub pVtbl: *const IADLX3DSettingsChangedListenerVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DSettingsChangedListener() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DSettingsChangedListener> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DSettingsChangedListener>(),
        8usize,
        "Size of IADLX3DSettingsChangedListener"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DSettingsChangedListener>(),
        8usize,
        "Alignment of IADLX3DSettingsChangedListener"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DSettingsChangedListener::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DSettingsChangedHandlingVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedHandling) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsChangedHandling) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsChangedHandling,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub Add3DSettingsEventListener: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsChangedHandling,
            p3DSettingsChangedListener: *mut IADLX3DSettingsChangedListener,
        ) -> ADLX_RESULT,
    >,
    pub Remove3DSettingsEventListener: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsChangedHandling,
            p3DSettingsChangedListener: *mut IADLX3DSettingsChangedListener,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DSettingsChangedHandlingVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DSettingsChangedHandlingVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DSettingsChangedHandlingVtbl>(),
        40usize,
        "Size of IADLX3DSettingsChangedHandlingVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DSettingsChangedHandlingVtbl>(),
        8usize,
        "Alignment of IADLX3DSettingsChangedHandlingVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DSettingsChangedHandlingVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DSettingsChangedHandlingVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DSettingsChangedHandlingVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add3DSettingsEventListener) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DSettingsChangedHandlingVtbl::Add3DSettingsEventListener"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).Remove3DSettingsEventListener) as usize - ptr as usize
        },
        32usize,
        "Offset of field: IADLX3DSettingsChangedHandlingVtbl::Remove3DSettingsEventListener"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DSettingsChangedHandling {
    pub pVtbl: *const IADLX3DSettingsChangedHandlingVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DSettingsChangedHandling() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DSettingsChangedHandling> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DSettingsChangedHandling>(),
        8usize,
        "Size of IADLX3DSettingsChangedHandling"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DSettingsChangedHandling>(),
        8usize,
        "Alignment of IADLX3DSettingsChangedHandling"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DSettingsChangedHandling::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DSettingsServicesVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsServices) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLX3DSettingsServices) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub GetAntiLag: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DAntiLag: *mut *mut IADLX3DAntiLag,
        ) -> ADLX_RESULT,
    >,
    pub GetChill: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DChill: *mut *mut IADLX3DChill,
        ) -> ADLX_RESULT,
    >,
    pub GetBoost: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DBoost: *mut *mut IADLX3DBoost,
        ) -> ADLX_RESULT,
    >,
    pub GetImageSharpening: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DImageSharpening: *mut *mut IADLX3DImageSharpening,
        ) -> ADLX_RESULT,
    >,
    pub GetEnhancedSync: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DEnhancedSync: *mut *mut IADLX3DEnhancedSync,
        ) -> ADLX_RESULT,
    >,
    pub GetWaitForVerticalRefresh: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DWaitForVerticalRefresh: *mut *mut IADLX3DWaitForVerticalRefresh,
        ) -> ADLX_RESULT,
    >,
    pub GetFrameRateTargetControl: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DFrameRateTargetControl: *mut *mut IADLX3DFrameRateTargetControl,
        ) -> ADLX_RESULT,
    >,
    pub GetAntiAliasing: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DAntiAliasing: *mut *mut IADLX3DAntiAliasing,
        ) -> ADLX_RESULT,
    >,
    pub GetMorphologicalAntiAliasing: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DMorphologicalAntiAliasing: *mut *mut IADLX3DMorphologicalAntiAliasing,
        ) -> ADLX_RESULT,
    >,
    pub GetAnisotropicFiltering: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DAnisotropicFiltering: *mut *mut IADLX3DAnisotropicFiltering,
        ) -> ADLX_RESULT,
    >,
    pub GetTessellation: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DTessellation: *mut *mut IADLX3DTessellation,
        ) -> ADLX_RESULT,
    >,
    pub GetRadeonSuperResolution: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pp3DRadeonSuperResolution: *mut *mut IADLX3DRadeonSuperResolution,
        ) -> ADLX_RESULT,
    >,
    pub GetResetShaderCache: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pGPU: *mut IADLXGPU,
            pp3DResetShaderCache: *mut *mut IADLX3DResetShaderCache,
        ) -> ADLX_RESULT,
    >,
    pub Get3DSettingsChangedHandling: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLX3DSettingsServices,
            pp3DSettingsChangedHandling: *mut *mut IADLX3DSettingsChangedHandling,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX3DSettingsServicesVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DSettingsServicesVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DSettingsServicesVtbl>(),
        136usize,
        "Size of IADLX3DSettingsServicesVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DSettingsServicesVtbl>(),
        8usize,
        "Alignment of IADLX3DSettingsServicesVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetAntiLag) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetAntiLag"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetChill) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetChill"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetBoost) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetBoost"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetImageSharpening) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetImageSharpening"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetEnhancedSync) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetEnhancedSync"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetWaitForVerticalRefresh) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetWaitForVerticalRefresh"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFrameRateTargetControl) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetFrameRateTargetControl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetAntiAliasing) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetAntiAliasing"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).GetMorphologicalAntiAliasing) as usize - ptr as usize
        },
        88usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetMorphologicalAntiAliasing"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetAnisotropicFiltering) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetAnisotropicFiltering"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetTessellation) as usize - ptr as usize },
        104usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetTessellation"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetRadeonSuperResolution) as usize - ptr as usize },
        112usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetRadeonSuperResolution"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetResetShaderCache) as usize - ptr as usize },
        120usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::GetResetShaderCache"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).Get3DSettingsChangedHandling) as usize - ptr as usize
        },
        128usize,
        "Offset of field: IADLX3DSettingsServicesVtbl::Get3DSettingsChangedHandling"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX3DSettingsServices {
    pub pVtbl: *const IADLX3DSettingsServicesVtbl,
}
#[test]
fn bindgen_test_layout_IADLX3DSettingsServices() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX3DSettingsServices> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX3DSettingsServices>(),
        8usize,
        "Size of IADLX3DSettingsServices"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX3DSettingsServices>(),
        8usize,
        "Alignment of IADLX3DSettingsServices"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX3DSettingsServices::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXFreeSyncVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXDisplayFreeSync) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXDisplayFreeSync) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayFreeSync,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayFreeSync,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayFreeSync,
            enabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayFreeSync, enabled: adlx_bool) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXFreeSyncVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXFreeSyncVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXFreeSyncVtbl>(),
        48usize,
        "Size of IADLXFreeSyncVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXFreeSyncVtbl>(),
        8usize,
        "Alignment of IADLXFreeSyncVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXFreeSyncVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXFreeSyncVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXFreeSyncVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXFreeSyncVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXFreeSyncVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXFreeSyncVtbl::SetEnabled"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayFreeSync {
    pub pVtbl: *const IADLXFreeSyncVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayFreeSync() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayFreeSync> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayFreeSync>(),
        8usize,
        "Size of IADLXDisplayFreeSync"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayFreeSync>(),
        8usize,
        "Alignment of IADLXDisplayFreeSync"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayFreeSync::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXVSRVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXDisplayVSR) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXDisplayVSR) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVSR,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVSR, supported: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVSR, enabled: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVSR, enabled: adlx_bool) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXVSRVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXVSRVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXVSRVtbl>(),
        48usize,
        "Size of IADLXVSRVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXVSRVtbl>(),
        8usize,
        "Alignment of IADLXVSRVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXVSRVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXVSRVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXVSRVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXVSRVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXVSRVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXVSRVtbl::SetEnabled"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayVSR {
    pub pVtbl: *const IADLXVSRVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayVSR() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayVSR> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayVSR>(),
        8usize,
        "Size of IADLXDisplayVSR"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayVSR>(),
        8usize,
        "Alignment of IADLXDisplayVSR"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayVSR::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXGPUScalingVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayGPUScaling) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayGPUScaling) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayGPUScaling,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayGPUScaling,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayGPUScaling,
            enabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayGPUScaling, enabled: adlx_bool) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXGPUScalingVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXGPUScalingVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXGPUScalingVtbl>(),
        48usize,
        "Size of IADLXGPUScalingVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXGPUScalingVtbl>(),
        8usize,
        "Alignment of IADLXGPUScalingVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXGPUScalingVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXGPUScalingVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXGPUScalingVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXGPUScalingVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXGPUScalingVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXGPUScalingVtbl::SetEnabled"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayGPUScaling {
    pub pVtbl: *const IADLXGPUScalingVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayGPUScaling() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayGPUScaling> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayGPUScaling>(),
        8usize,
        "Size of IADLXDisplayGPUScaling"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayGPUScaling>(),
        8usize,
        "Alignment of IADLXDisplayGPUScaling"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayGPUScaling::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayScalingModeVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayScalingMode) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayScalingMode) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayScalingMode,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayScalingMode,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetMode: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayScalingMode,
            currentMode: *mut ADLX_SCALE_MODE,
        ) -> ADLX_RESULT,
    >,
    pub SetMode: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayScalingMode,
            mode: ADLX_SCALE_MODE,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXDisplayScalingModeVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayScalingModeVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayScalingModeVtbl>(),
        48usize,
        "Size of IADLXDisplayScalingModeVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayScalingModeVtbl>(),
        8usize,
        "Alignment of IADLXDisplayScalingModeVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayScalingModeVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXDisplayScalingModeVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXDisplayScalingModeVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXDisplayScalingModeVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMode) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXDisplayScalingModeVtbl::GetMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetMode) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXDisplayScalingModeVtbl::SetMode"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayScalingMode {
    pub pVtbl: *const IADLXDisplayScalingModeVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayScalingMode() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayScalingMode> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayScalingMode>(),
        8usize,
        "Size of IADLXDisplayScalingMode"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayScalingMode>(),
        8usize,
        "Alignment of IADLXDisplayScalingMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayScalingMode::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXIntegerScalingVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayIntegerScaling) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayIntegerScaling) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayIntegerScaling,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayIntegerScaling,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayIntegerScaling,
            enabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayIntegerScaling,
            enabled: adlx_bool,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXIntegerScalingVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXIntegerScalingVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXIntegerScalingVtbl>(),
        48usize,
        "Size of IADLXIntegerScalingVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXIntegerScalingVtbl>(),
        8usize,
        "Alignment of IADLXIntegerScalingVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXIntegerScalingVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXIntegerScalingVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXIntegerScalingVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXIntegerScalingVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXIntegerScalingVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXIntegerScalingVtbl::SetEnabled"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayIntegerScaling {
    pub pVtbl: *const IADLXIntegerScalingVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayIntegerScaling() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayIntegerScaling> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayIntegerScaling>(),
        8usize,
        "Size of IADLXDisplayIntegerScaling"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayIntegerScaling>(),
        8usize,
        "Alignment of IADLXDisplayIntegerScaling"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayIntegerScaling::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX_COLOR_DEPTHVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayColorDepth) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayColorDepth) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetValue: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            currentColorDepth: *mut ADLX_COLOR_DEPTH,
        ) -> ADLX_RESULT,
    >,
    pub SetValue: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            colorDepth: ADLX_COLOR_DEPTH,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedColorDepth: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            colorDepth: ADLX_COLOR_DEPTH,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedBPC_6: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedBPC_8: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedBPC_10: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedBPC_12: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedBPC_14: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedBPC_16: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayColorDepth,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX_COLOR_DEPTHVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX_COLOR_DEPTHVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX_COLOR_DEPTHVtbl>(),
        104usize,
        "Size of IADLX_COLOR_DEPTHVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX_COLOR_DEPTHVtbl>(),
        8usize,
        "Alignment of IADLX_COLOR_DEPTHVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetValue) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::GetValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetValue) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::SetValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedColorDepth) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::IsSupportedColorDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedBPC_6) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::IsSupportedBPC_6"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedBPC_8) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::IsSupportedBPC_8"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedBPC_10) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::IsSupportedBPC_10"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedBPC_12) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::IsSupportedBPC_12"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedBPC_14) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::IsSupportedBPC_14"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedBPC_16) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLX_COLOR_DEPTHVtbl::IsSupportedBPC_16"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayColorDepth {
    pub pVtbl: *const IADLX_COLOR_DEPTHVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayColorDepth() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayColorDepth> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayColorDepth>(),
        8usize,
        "Size of IADLXDisplayColorDepth"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayColorDepth>(),
        8usize,
        "Alignment of IADLXDisplayColorDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayColorDepth::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLX_PIXEL_FORMATVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayPixelFormat) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayPixelFormat) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetValue: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            pixelFormat: *mut ADLX_PIXEL_FORMAT,
        ) -> ADLX_RESULT,
    >,
    pub SetValue: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            pixelFormat: ADLX_PIXEL_FORMAT,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedPixelFormat: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            pixelFormat: ADLX_PIXEL_FORMAT,
            supportd: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedRGB444Full: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            supportd: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedYCbCr444: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            supportd: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedYCbCr422: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            supportd: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedRGB444Limited: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            supportd: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsSupportedYCbCr420: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayPixelFormat,
            supportd: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLX_PIXEL_FORMATVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLX_PIXEL_FORMATVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLX_PIXEL_FORMATVtbl>(),
        96usize,
        "Size of IADLX_PIXEL_FORMATVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLX_PIXEL_FORMATVtbl>(),
        8usize,
        "Alignment of IADLX_PIXEL_FORMATVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetValue) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::GetValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetValue) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::SetValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedPixelFormat) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::IsSupportedPixelFormat"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedRGB444Full) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::IsSupportedRGB444Full"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedYCbCr444) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::IsSupportedYCbCr444"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedYCbCr422) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::IsSupportedYCbCr422"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedRGB444Limited) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::IsSupportedRGB444Limited"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupportedYCbCr420) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLX_PIXEL_FORMATVtbl::IsSupportedYCbCr420"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayPixelFormat {
    pub pVtbl: *const IADLX_PIXEL_FORMATVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayPixelFormat() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayPixelFormat> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayPixelFormat>(),
        8usize,
        "Size of IADLXDisplayPixelFormat"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayPixelFormat>(),
        8usize,
        "Alignment of IADLXDisplayPixelFormat"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayPixelFormat::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXCustomColorVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayCustomColor) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayCustomColor) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsHueSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetHueRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub GetHue: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            currentHue: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub SetHue: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayCustomColor, hue: adlx_int) -> ADLX_RESULT,
    >,
    pub IsSaturationSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetSaturationRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub GetSaturation: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            currentSaturation: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub SetSaturation: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            saturation: adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub IsBrightnessSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetBrightnessRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub GetBrightness: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            currentBrightness: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub SetBrightness: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            brightness: adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub IsContrastSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetContrastRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub GetContrast: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            currentContrast: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub SetContrast: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            contrast: adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub IsTemperatureSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetTemperatureRange: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            range: *mut ADLX_IntRange,
        ) -> ADLX_RESULT,
    >,
    pub GetTemperature: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            currentTemperature: *mut adlx_int,
        ) -> ADLX_RESULT,
    >,
    pub SetTemperature: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomColor,
            temperature: adlx_int,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXCustomColorVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXCustomColorVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXCustomColorVtbl>(),
        184usize,
        "Size of IADLXCustomColorVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXCustomColorVtbl>(),
        8usize,
        "Alignment of IADLXCustomColorVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXCustomColorVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXCustomColorVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXCustomColorVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsHueSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXCustomColorVtbl::IsHueSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetHueRange) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXCustomColorVtbl::GetHueRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetHue) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXCustomColorVtbl::GetHue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetHue) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXCustomColorVtbl::SetHue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSaturationSupported) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXCustomColorVtbl::IsSaturationSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSaturationRange) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXCustomColorVtbl::GetSaturationRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSaturation) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXCustomColorVtbl::GetSaturation"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetSaturation) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXCustomColorVtbl::SetSaturation"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsBrightnessSupported) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXCustomColorVtbl::IsBrightnessSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetBrightnessRange) as usize - ptr as usize },
        96usize,
        "Offset of field: IADLXCustomColorVtbl::GetBrightnessRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetBrightness) as usize - ptr as usize },
        104usize,
        "Offset of field: IADLXCustomColorVtbl::GetBrightness"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetBrightness) as usize - ptr as usize },
        112usize,
        "Offset of field: IADLXCustomColorVtbl::SetBrightness"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsContrastSupported) as usize - ptr as usize },
        120usize,
        "Offset of field: IADLXCustomColorVtbl::IsContrastSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetContrastRange) as usize - ptr as usize },
        128usize,
        "Offset of field: IADLXCustomColorVtbl::GetContrastRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetContrast) as usize - ptr as usize },
        136usize,
        "Offset of field: IADLXCustomColorVtbl::GetContrast"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetContrast) as usize - ptr as usize },
        144usize,
        "Offset of field: IADLXCustomColorVtbl::SetContrast"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsTemperatureSupported) as usize - ptr as usize },
        152usize,
        "Offset of field: IADLXCustomColorVtbl::IsTemperatureSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetTemperatureRange) as usize - ptr as usize },
        160usize,
        "Offset of field: IADLXCustomColorVtbl::GetTemperatureRange"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetTemperature) as usize - ptr as usize },
        168usize,
        "Offset of field: IADLXCustomColorVtbl::GetTemperature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetTemperature) as usize - ptr as usize },
        176usize,
        "Offset of field: IADLXCustomColorVtbl::SetTemperature"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayCustomColor {
    pub pVtbl: *const IADLXCustomColorVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayCustomColor() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayCustomColor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayCustomColor>(),
        8usize,
        "Size of IADLXDisplayCustomColor"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayCustomColor>(),
        8usize,
        "Alignment of IADLXDisplayCustomColor"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayCustomColor::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXHDCPVtbl {
    pub Acquire:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXDisplayHDCP) -> adlx_long>,
    pub Release:
        ::std::option::Option<unsafe extern "C" fn(pThis: *mut IADLXDisplayHDCP) -> adlx_long>,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayHDCP,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayHDCP,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayHDCP, enabled: *mut adlx_bool) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayHDCP, enabled: adlx_bool) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXHDCPVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXHDCPVtbl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXHDCPVtbl>(),
        48usize,
        "Size of IADLXHDCPVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXHDCPVtbl>(),
        8usize,
        "Alignment of IADLXHDCPVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXHDCPVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXHDCPVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXHDCPVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXHDCPVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXHDCPVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXHDCPVtbl::SetEnabled"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayHDCP {
    pub pVtbl: *const IADLXHDCPVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayHDCP() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayHDCP> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayHDCP>(),
        8usize,
        "Size of IADLXDisplayHDCP"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayHDCP>(),
        8usize,
        "Alignment of IADLXDisplayHDCP"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayHDCP::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayResolutionVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolution) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolution) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayResolution,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub GetValue: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayResolution,
            cr: *mut ADLX_CustomResolution,
        ) -> ADLX_RESULT,
    >,
    pub SetValue: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayResolution,
            cr: ADLX_CustomResolution,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXDisplayResolutionVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayResolutionVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayResolutionVtbl>(),
        40usize,
        "Size of IADLXDisplayResolutionVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayResolutionVtbl>(),
        8usize,
        "Alignment of IADLXDisplayResolutionVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayResolutionVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXDisplayResolutionVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXDisplayResolutionVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetValue) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXDisplayResolutionVtbl::GetValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetValue) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXDisplayResolutionVtbl::SetValue"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayResolution {
    pub pVtbl: *const IADLXDisplayResolutionVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayResolution() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayResolution> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayResolution>(),
        8usize,
        "Size of IADLXDisplayResolution"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayResolution>(),
        8usize,
        "Alignment of IADLXDisplayResolution"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayResolution::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayResolutionListVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolutionList) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolutionList) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayResolutionList,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub Size: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolutionList) -> adlx_uint,
    >,
    pub Empty: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolutionList) -> adlx_bool,
    >,
    pub Begin: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolutionList) -> adlx_uint,
    >,
    pub End: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolutionList) -> adlx_uint,
    >,
    pub At: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayResolutionList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub Clear: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolutionList) -> ADLX_RESULT,
    >,
    pub Remove_Back: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayResolutionList) -> ADLX_RESULT,
    >,
    pub Add_Back: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayResolutionList,
            pItem: *mut IADLXInterface,
        ) -> ADLX_RESULT,
    >,
    pub At_DisplayResolutionList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayResolutionList,
            location: adlx_uint,
            ppItem: *mut *mut IADLXDisplayResolution,
        ) -> ADLX_RESULT,
    >,
    pub Add_Back_DisplayResolutionList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayResolutionList,
            pItem: *mut IADLXDisplayResolution,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXDisplayResolutionListVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayResolutionListVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayResolutionListVtbl>(),
        104usize,
        "Size of IADLXDisplayResolutionListVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayResolutionListVtbl>(),
        8usize,
        "Alignment of IADLXDisplayResolutionListVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Size) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Empty) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Empty"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Begin) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Begin"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).End) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::End"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::At"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Clear) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Clear"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Remove_Back) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Remove_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Add_Back) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Add_Back"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).At_DisplayResolutionList) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::At_DisplayResolutionList"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).Add_Back_DisplayResolutionList) as usize - ptr as usize
        },
        96usize,
        "Offset of field: IADLXDisplayResolutionListVtbl::Add_Back_DisplayResolutionList"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayResolutionList {
    pub pVtbl: *const IADLXDisplayResolutionListVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayResolutionList() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayResolutionList> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayResolutionList>(),
        8usize,
        "Size of IADLXDisplayResolutionList"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayResolutionList>(),
        8usize,
        "Alignment of IADLXDisplayResolutionList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayResolutionList::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayCustomResolutionVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayCustomResolution) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayCustomResolution) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomResolution,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomResolution,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub GetResolutionList: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomResolution,
            ppResolutionList: *mut *mut IADLXDisplayResolutionList,
        ) -> ADLX_RESULT,
    >,
    pub GetCurrentAppliedResolution: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomResolution,
            ppResolution: *mut *mut IADLXDisplayResolution,
        ) -> ADLX_RESULT,
    >,
    pub CreateNewResolution: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomResolution,
            pResolution: *mut IADLXDisplayResolution,
        ) -> ADLX_RESULT,
    >,
    pub DeleteResolution: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayCustomResolution,
            pResolution: *mut IADLXDisplayResolution,
        ) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXDisplayCustomResolutionVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayCustomResolutionVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayCustomResolutionVtbl>(),
        64usize,
        "Size of IADLXDisplayCustomResolutionVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayCustomResolutionVtbl>(),
        8usize,
        "Alignment of IADLXDisplayCustomResolutionVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayCustomResolutionVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXDisplayCustomResolutionVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXDisplayCustomResolutionVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXDisplayCustomResolutionVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetResolutionList) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXDisplayCustomResolutionVtbl::GetResolutionList"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCurrentAppliedResolution) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXDisplayCustomResolutionVtbl::GetCurrentAppliedResolution"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CreateNewResolution) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXDisplayCustomResolutionVtbl::CreateNewResolution"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeleteResolution) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXDisplayCustomResolutionVtbl::DeleteResolution"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayCustomResolution {
    pub pVtbl: *const IADLXDisplayCustomResolutionVtbl,
}
#[test]
fn bindgen_test_layout_IADLXDisplayCustomResolution() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayCustomResolution> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayCustomResolution>(),
        8usize,
        "Size of IADLXDisplayCustomResolution"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayCustomResolution>(),
        8usize,
        "Alignment of IADLXDisplayCustomResolution"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pVtbl) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayCustomResolution::pVtbl"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IADLXDisplayVariBrightVtbl {
    pub Acquire: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVariBright) -> adlx_long,
    >,
    pub Release: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVariBright) -> adlx_long,
    >,
    pub QueryInterface: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVariBright,
            interfaceId: *const wchar_t,
            ppInterface: *mut *mut ::std::os::raw::c_void,
        ) -> ADLX_RESULT,
    >,
    pub IsSupported: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVariBright,
            supported: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsEnabled: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVariBright,
            enabled: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetEnabled: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVariBright, enabled: adlx_bool) -> ADLX_RESULT,
    >,
    pub IsCurrentMaximizeBrightness: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVariBright,
            maximizeBrightness: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsCurrentOptimizeBrightness: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVariBright,
            optimizeBrightness: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsCurrentBalanced: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVariBright,
            balanced: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsCurrentOptimizeBattery: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVariBright,
            optimizeBattery: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub IsCurrentMaximizeBattery: ::std::option::Option<
        unsafe extern "C" fn(
            pThis: *mut IADLXDisplayVariBright,
            maximizeBattery: *mut adlx_bool,
        ) -> ADLX_RESULT,
    >,
    pub SetMaximizeBrightness: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVariBright) -> ADLX_RESULT,
    >,
    pub SetOptimizeBrightness: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVariBright) -> ADLX_RESULT,
    >,
    pub SetBalanced: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVariBright) -> ADLX_RESULT,
    >,
    pub SetOptimizeBattery: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVariBright) -> ADLX_RESULT,
    >,
    pub SetMaximizeBattery: ::std::option::Option<
        unsafe extern "C" fn(pThis: *mut IADLXDisplayVariBright) -> ADLX_RESULT,
    >,
}
#[test]
fn bindgen_test_layout_IADLXDisplayVariBrightVtbl() {
    const UNINIT: ::std::mem::MaybeUninit<IADLXDisplayVariBrightVtbl> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IADLXDisplayVariBrightVtbl>(),
        128usize,
        "Size of IADLXDisplayVariBrightVtbl"
    );
    assert_eq!(
        ::std::mem::align_of::<IADLXDisplayVariBrightVtbl>(),
        8usize,
        "Alignment of IADLXDisplayVariBrightVtbl"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Acquire) as usize - ptr as usize },
        0usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::Acquire"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Release) as usize - ptr as usize },
        8usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::Release"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).QueryInterface) as usize - ptr as usize },
        16usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::QueryInterface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSupported) as usize - ptr as usize },
        24usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::IsSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsEnabled) as usize - ptr as usize },
        32usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::IsEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetEnabled) as usize - ptr as usize },
        40usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::SetEnabled"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsCurrentMaximizeBrightness) as usize - ptr as usize },
        48usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::IsCurrentMaximizeBrightness"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsCurrentOptimizeBrightness) as usize - ptr as usize },
        56usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::IsCurrentOptimizeBrightness"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsCurrentBalanced) as usize - ptr as usize },
        64usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::IsCurrentBalanced"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsCurrentOptimizeBattery) as usize - ptr as usize },
        72usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::IsCurrentOptimizeBattery"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsCurrentMaximizeBattery) as usize - ptr as usize },
        80usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::IsCurrentMaximizeBattery"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetMaximizeBrightness) as usize - ptr as usize },
        88usize,
        "Offset of field: IADLXDisplayVariBrightVtbl::SetMaximizeBrightness"
    );
    assert_eq!(
